[
    {
        "speaker": "Donald Trump",
        "date": "Unknown",
        "location": "Unknown",
        "title": "Unknown",
        "text": "Donald Trump (00:00):\n\nWow. Hello Pennsylvania. What a great place.\n\nAudience (00:03):\n\nUSA. USA. USA. USA. USA. USA. USA. USA. USA.\n\nDonald Trump (00:14):\n\nThank you very much. You know the pilot said, “It’s too windy to land, sir.” I said, “That’s okay. Land anyway. We have no choice.” It’s windy out here. It’s windy, but it’s beautiful. It’s Pennsylvania. It’s our place. I’m thrilled to be back in this beautiful Commonwealth with thousands of proud, hard-working American patriots. That’s what you are. With your help, we’re going to win Pennsylvania. We’re going to defeat Crooked Joe Biden, and we’re going to make America great again.\n\n(00:51)\nBefore going any further, I want to say God bless the people of Israel. They’re under attack right now. That’s because we show great weakness. This would not happen, the weakness that we’ve shown, it’s unbelievable and it would not have happened if we were in office. You know that, they know that, everybody knows that. But America prays for Israel. We send our absolute support to everyone in harm’s way.\n\n(01:17)\nThis is an attack that would not have happened. To think about what we have to go through and the things we put up with with the border, with no energy independence, with all electric cars. Would everybody like to buy an electric car for the rest of your life? But we will return the world to peace through strength, and it’ll happen very quickly. We’ll revive American strength abroad, and we will restore American strength at home. We were respected four years ago all over the world. Today, we are considered a joke. It’s not going to be for long, believe me. It’s not going to be for long.\n\n(01:59)\nWe will quickly rebuild the greatest economy in the history of the world like we had just four years ago. It was just announced that inflation is once again raging. It’s close to 4% again. Here we go. When I left office, we had virtually no inflation.\n\n(02:16)\nFirst of all, Crooked Joe, he claimed inflation was transitory. Remember that? Then he said it was temporary. Then he said it won’t happen. It really won’t happen. And then he said, “Well, it’s much higher than expected.” And then the supply chain slows, and then the energy went through the roof. Putin, they called it Putin price hikes. It wasn’t only Putin. It was Putin and plenty of other things that Biden got wrong. [inaudible 00:02:44] with Putin, Ukraine would’ve never happened. Israel attack, both October 7th and today would’ve never happened.\n\n(02:54)\nThen he blamed price gouging and junk fees. But all of America knows that the real blame for this nightmare lies with one person: Crooked Joe Biden. As Crooked as you can get. That’s why the people of Pennsylvania are going to tell Crooked Joe, “You’re fired. Get out. You’re fired.”\n\n(03:20)\nOne of the leading drivers of Biden’s inflation disasters is war on American energy, and Pennsylvania energy is our big problem.\n\nAudience (03:47):\n\nGenocide Joe. Genocide Joe.\n\nDonald Trump (03:47):\n\nThey’re not wrong. They’re not wrong. He’s done everything wrong. Think of it. We’ve been in this mess together for three and a half years, only a little more than six months until that most important day in the history of our country, November 5th. Think of that. [inaudible 00:04:10] nothing.\n\n(04:10)\nHas anything that he’s done turned out? Everything he touches turns to shit. It’s true. Under Biden, gasoline prices are up over 50%. And electricity prices are up 39%, rising 13 times faster than under the previous… Think of that, 13 times faster than under the previous seven years. When I’m back in the White House, we will end Joe Biden’s inflation train wreck, and we will tell Pennsylvania “Drill, baby, drill.” Get back to drilling.\n\n(04:54)\nUnder my leadership, we had energy independence, and soon we would’ve had energy dominance. We were going to be dominant. We were bigger than Russia. We were bigger than Saudi Arabia. And then he stopped. But then he started again. He went back to Trump policies because the price started going up so high. But the day after the election, first of all, if he wins, our country is going to be destroyed the day after the election, if he wins. He will stop drilling and he’ll go back to wind, which doesn’t work. He’ll go back to all sorts of things that don’t work. And they’ve proven that.\n\n(05:29)\nWhen it comes to Biden, he launched an extremist crusade actually to smash oil and gas, but Pennsylvania is one of the big oil and gas largely due to me. He wanted to smash it. Biden has imposed a savage natural gas export ban that’s putting countless Pennsylvania jobs at risk. He’s risking your lives, he’s risking your jobs, but he doesn’t care because all he cares about is the Green New Scam, the Green New Deal, the Green New Scam. The Green New Scam, one of the biggest hoaxes.\n\n(06:08)\nBiden’s also trying to abolish gasoline-powered automobiles and force everyone into an all electric car. But I have good news for you, all of you that love those trucks, he wants to make your truck all electric, too. No more gasoline-powered. On day one, I will terminate Crooked Joe’s insane electric vehicle mandate. Gone. Day one. That’s going to happen on day one. And I’ll end Joe Biden’s natural gas export ban on behalf of the people of Pennsylvania, who I love. I went to school here. I went to school in Pennsylvania. I love Pennsylvania.\n\n(06:53)\nAs we rescue our economy, we will also rescue our democracy. Our democracy is under, really under siege. Our Second Amendment is under siege, but not with me it’s not. With me they don’t touch it. But our Second Amendment is under siege. Our democracy is under siege because of Joe Biden. Joe Biden loves to say that democracy is on the ballot in this election. If it is, we’re going to win in the greatest landslide in history. Because we’re the ones who are fighting to save our democracy, and Crooked Joe Biden is the demented tyrant. He’s the demented tyrant who is trying to destroy our democracy.\n\n(07:33)\nTwo days from now, the entire world will witness the commencement of the very first Biden trial. They’re all Biden trials, you know that, right? And I’m proud to do it for you. Have a good time watching. Have a good time watching. On Monday in New York City, I will be forced to sit fully gagged. I’m not allowed to talk. Can you believe it? They want to take away my constitutional right to talk. I have a crooked judge. This has never happened before, by the way, you do know that, right? Fully gagged before a highly conflicted and corrupt judge who suffers from TDS.\n\n(08:17)\nDoes anyone know what TDS is?\n\nAudience (08:21):\n\nTrump Derangement Syndrome.\n\nDonald Trump (08:23):\n\nCorrect. Trump Derangement Syndrome. As the radical left Democrat party seeks to do anything possible to keep me from running and winning in this election. And let me tell you, we’re leading by so much, they don’t know what’s happening. But you know what they’d love to do? I did nothing wrong. From day one I did nothing. You had Russia, Russia. You had Ukraine, Ukraine, Ukraine. You had every hoax imaginable. With all of the things they did with millions of pages of study, they found nothing, which makes me perhaps the most honest guy almost in the world, I think. They found nothing.\n\n(09:04)\nBut like all true communist show trials, this is what you call a communist show trial. And we’re going communist. Don’t kid yourself. We don’t win this election, this country is finished.\n\nAudience (09:16):\n\nWe love Trump. We love Trump. We love Trump. We love Trump. We love Trump. We love Trump. We love Trump. We love Trump. We love Trump. We love Trump.\n\nDonald Trump (09:28):\n\nThank you very much. I love you, too. I love you, too. That’s why I put up with this stuff. Remember, I’ve been indicted more than Al Capone, the great gangster. I never heard the word indictment. I didn’t know. Now, all of a sudden, if I fly over a Democrat state, they call it a blue state. I get subpoenaed before a grand jury. It’s horrible. Honestly, it’s horrible what they’re doing.\n\n(09:54)\nThey’re ruining this country. They’re destroying the country in every way. There’s not a thing he’s done that’s been good. But this is a case of blatant manipulation of the law and the facts like Russia, Russia, Russia, and all of the other hoaxes that we’ve had to endure. The phony indictment has been torn apart and demolished by legal experts from across the political spectrum.\n\n(10:14)\nEvery single legal expert, without exception, that I can find has said as an example, Alan Dershowitz. Alan Dershowitz said, “I’ve been doing this for 60 years, teaching criminal cases, defending criminal cases, writing about criminal cases. And this is by far the weakest criminal case I’ve ever seen in my 60 years. There is absolutely nothing here. There is no misdemeanor, there is no felony, there is no federal crime. Every American is in danger if we don’t have an objective standard of justice that’s equally applicable to all.” That’s Alan Dershowitz. He’s a Democrat. He’s no fan of mine. He’s a Democrat and a Harvard professor, smart guy, but he’s a Democrat. He writes that.\n\n(11:02)\nHere’s another one. Highly respected, former federal prosecutor, Andrew McCarthy stated: “It would take us an hour just to flush out all of the problems with this case. The premise of this prosecution is falsification.” What Bragg, that’s Alvin Bragg. He’s a Soros-appointed prosecutor. And by the way, crime in New York is at record highs. The violent crime, murders, killings, all of this stuff, muggings. And he leaves them alone. They’ve got… When I go into court over nothing, it’s not a crime. When I go into court, they’ve got like nine prosecutors. And in the meantime, people that murder, nobody does anything.\n\n(11:45)\nWhat Bragg, Alvin Bragg is trying to do is enforce federal campaign finance law, which he doesn’t have any authority whatsoever do. He’s not allowed to finance. And by the way, the federal government looked at it, turned it down. It’s a garbage case that he himself rejected a year earlier. When Bragg came into office, he’s the district attorney. He said, “I’m not doing this case. This case is bullshit.” And then what happens? He does the case.\n\n(12:11)\nAnd you know, here’s the thing. They could have done this case seven years ago. You know the way they’re trying to rush it? This case would’ve been fine. Seven years ago, do whatever you want. They do it right smack in the middle of our election campaign. And I talk about our campaign. We want to do it now. And the same thing with Deranged Jack Smith, all of these people, these are Biden people. He can’t win an election. He can’t put two sentences together. He can’t find the stairs on a platform to walk off after he makes about a two-minute speech. Here they are. I got one, two, three. I got one in the back. I got them all over the place. He can’t find them. He’s looking around, “Where are the stairs?”\n\n(12:55)\nAll they’re trying to do, they’re weaponizing government. They’re trying to harm your favorite president, hurt him so that we can’t win an election. They’ve weaponized elections like a third-world country, like a Banana Republic. Renowned legal scholar, very smart guy, Jonathan Turley, likewise stated, “It’s a real Frankenstein case. It’s made up of different parts that don’t hold together, and it’s frightening if this can be replicated in the future. You can’t do cases like this. This is an outrage.”\n\n(13:28)\nA veteran New York City attorney told left-wing Rolling Stone Magazine, this is a magazine that I’ve never read, but probably doesn’t like Trump, left-wing is to put it mildly. “This case,” they say, this is Rolling Stone, “This case is a joke, frankly, and I’ve litigated against this office for 33 years. This case is an absolute joke.” These are people that hate me, they’re saying this. Can you imagine if they liked me, how good they’d be?\n\n(13:57)\nAnd a liberal Fordham University law professor writing in The New York Times called the case “A disaster, a legal embarrassment And a setback to the rule of law and order and a really bad thing for New York.” And businesses aren’t going to move into New York because of what they’re doing. Their legal system is shot. It’s a joke all over the world. But when I walk into that courtroom, I know I will have the love of 200 million Americans behind me, and I will be fighting for the… That’s right. That’s right. And I will be fighting for the freedom of 325 million Americans.\n\n(14:41)\nThis election is a choice between the Biden-fascist state or the American republic. It’s called we are going to make this country so great again, and we’re going to do it fast. We’re going to do it really fast. Right now, millions of people are entering our country from prisons, from mental institutions. They’re coming from all over the world. All over the world. A vote for Joe Biden is a vote to end the rule of law. And it’s a vote to destroy America as you know it.\n\n(15:15)\nA vote for Donald Trump is a vote to save America’s future, a vote to save American democracy and a vote to save American freedom.\n\nAudience (15:38):\n\nUSA. USA. USA. USA. USA. USA.\n\nDonald Trump (15:38):\n\nAnd as I say, and I’ve said tonight, and I’ll say it again and again, and I mean it so much, when we had a beautiful November day, 2016, we won an election and people are still angry about it because we weren’t anticipated. They rig everything. We weren’t anticipated to win that election. And what I’ve\n\nDonald Trump (16:00):\n\n… I’ve done to insult them is we won that election, and then we did much better in 2020 than we did in 2016, getting millions and millions of votes more. But this is going to be really special, because I will tell you, 2016, we had spirit like nobody’s ever seen before. 2020 blew the spirit away of 2016. Not only do we get millions more votes, I think the spirit was even greater. But now, because we’ve seen how bad they are, added to the fact that you like the job I do, you like the fact that countries respect us. You like the fact that we were energy-independent, and all of the things. You like the fact that I got you the largest tax cut in the history of our country, and they’re going to raise your taxes by four times. Four times. Think of that. Take your taxes and multiply times four. That’s what you’re going to be paying if this person gets in.\n\n(17:01)\nBut I say this, and I said in 2016 that this is going to be the most important election we’ve ever had. But I say now, because 2016, I won to a certain extent on the border. And then I fixed the border. And when I fixed it, I wanted to make speeches in 2020 about the border. And my people said, “Sir…” But the difference is I listen to myself. I don’t listen to anybody. He listens to his people. He listens to his Communist handlers, okay? He does whatever they want him to do. But my people did say, “Sir, they don’t want to hear about the border. You fixed it.” I said, “I want to talk about the border.”\n\n(17:37)\nThey said, “Sir, you fixed it.” We went on. We had an unbelievable election, getting millions more votes than we did in 2016, but the election was rigged. The election was rigged. Pure and simple, 2020 was rigged. It was a disgrace. We could never let it happen again. The difference, though, is this is compared to 2016 and the border, this border is a hundred times worse. This is the worst border of any country in the history of the world. There has never been a border like this, where millions and millions and millions of people are coming in, totally unchecked and unvetted.\n\n(18:20)\nThe American people are going to stand up, and they’re going to stand up to the lies and the witch hunt and the corruption of Biden. He is the most incompetent president in the history of our country. He is the most corrupt president in the history of our country, and he is the worst president by far in the history of our country, and we have to get him out on November 5th. We have to get Biden the hell out of office and send him back to wherever he comes from.\n\nAudience (18:52):\n\nWe love Trump.\n\nDonald Trump (19:03):\n\nWe have to get him out.\n\nAudience (19:12):\n\nWe love Trump. We love Trump. We love Trump. We love Trump. We love Trump. We love Trump. We love Trump. We love Trump.\n\nDonald Trump (19:17):\n\nThank you very much. We have to get him out. You look at all the things that are happening, everything. The whole world is ablaze. It’s interesting. Viktor Orban, who is the prime minister of Hungary, very strong guy, very strong person, I think happens to be a very good person, but a very strong person. Doesn’t play games, didn’t want any illegal immigrants in his country. Then they say, “Oh, he’s such a bad…” Well, they asked him three weeks ago, “What’s going on with the world? What’s going on? Everybody’s fighting. Russia, Ukraine, Israel. The Middle East is blowing up. Everything’s blowing up. China’s going to be next with Taiwan, because of weakness. China’s going to be next. What’s going on?”\n\n(20:02)\nHe said, “Bring Donald Trump back as president, and it’ll all stop. It’ll all stop.” He said it. And he said something else, and I wouldn’t say it, because I wouldn’t really like the word. “China was afraid of Donald Trump. Russia was afraid of Donald Trump. Everybody was afraid.” I don’t want to say that. I want to say they respected me. But the fact is, none of this stuff would be happening. None of it would be happening right now. We’d have a country that would be peaceful, prosperous. We would’ve had no inflation. Inflation was caused by energy. This stupid person, what he did with energy was that it went up 40, 50, 60%. That affects everything. Everything. If you make donuts, everything is more expensive. It’s so bad. When you look at food prices now, where it’s gone up by double and triple and quadruple, and you can never get that back. But we’re going to get it way down, I promise you.\n\n(21:11)\nAnd we’re going to bring your energy so low that other things will follow. And that’s what happened. It’s very simple. Instead of trying to have corrupt prosecutors fight his battles, he’s incompetent, and what he’s doing, and I don’t believe it’s even him. I think it’s the people that want to keep their jobs around him. They’re Communists. They want to keep the job. Because I don’t think he has any clue. I don’t think he has any clue. So listen, we have a little… Look at this one. That’s for him. It’s slight. I call it slight. See the podium? I’m calling on crooked Joe Biden to debate anytime, anywhere, anyplace, right there.\n\n(21:57)\nWe have to debate, because our country is going in the wrong direction so badly. And while it’s a little bit typically early, we have to debate. We have to explain to the American people what the hell is going on. Because they’re looking at the border and they’re looking at inflation, and they’re looking at the economy, which is terrible. They’re looking at every single aspect of our country. They look at the fact that the world is laughing at our leader, and laughing at us.\n\n(22:29)\nAnd just four years ago, was the exact opposite. We were the most respected country in the world. We were the most respected that we were ever respected. We were never more respected than we were four years ago. It’s no wonder Joe Biden and his thugs… That’s all they are, they’re weak thugs… Are so desperate to stop us. They know that we are the only ones who can stop them. And all of this persecution of Donald Trump, I don’t mind. I’m doing it for you. I’m doing it for you. But all of this persecution is only happening because I’m running for president, and leading very big in the polls. We’re leading so big. They’re going crazy. They are going crazy.\n\n(23:16)\nIn the Wall Street Journal, they just came out with a poll. We’re leading big in a place called… Have you ever heard of Pennsylvania? And nationwide, we’re leading by four points, six points, nine points, 11 points. We’re leading by a lot. Now they cheat so we have to give ourselves a lead. They cheat like hell. And when you see them cheating, you get out there and start screaming. Start screaming. The radical left Democrats rigged the presidential election in 2020, and we’re not going to allow them to rig the presidential election of 2024. Every time the radical left Democrats, Marxists, Communists, and fascists indict me, I consider it a great badge of honor, because I am being indicted for you. Thank you very much. I appreciate it. Never forget, our enemies want to take away my freedom, because I will never, ever let them take away your freedom. I will not let it happen. It’s what they’re trying to do. They want to silence me, because I will never let them silence you. And in the end, they’re not after me. They’re after you. And I just happen to be standing in their way, and I always will be in their way.\n\n(24:46)\nSo job number one is going to be, and as soon as we take office, we will seal the border. Is that okay? And we’re going to stop the invasion, and send Joe Biden’s illegal aliens back home. We had the safest border, the most secure border in the history of our country four years ago, the safest border in the history of our country. There are charts out that just came out from Homeland Security, if you can believe that. And I don’t know where the hell your board is. Put it up inside of the back of my head. I’d love to have that chart. But it shows that the lowest number ever of illegal immigrants coming in was my last week in office before this very, very, very horrible president took over. One thing good about it, though, Jimmy Carter is a nice man. Jimmy Carter looks like a brilliant president by comparison to crooked Joe Biden. Crooked Joe Biden, he is the worst. Jimmy Carter is a happy man.\n\n(25:53)\nOh. Hey, that’s a good staff. I didn’t think that’d find that one. That’s the one. See the arrow in the bottom? That’s exactly when I went. See the number? That’s the lowest number in the history of our country the week that I went out. And then look at after that, it looks like a rocket ship. It’s a rocket ship of illegal immigrants and people that we have no idea where the hell they come from. People don’t even know the names of the country. The people coming here don’t even know the names of the country from which they came. And you see the right-hand side when it goes up. If you extend the chart a little bit, we could modernize it a little bit. Add another 25%. There has never been anything like it. In Venezuela, violent crime is down 67%, because they’re taking their gangs and their thugs and their criminals, and dumping them all across the United States of America. How about that? How about that?\n\nAudience (26:57):\n\nBoo.\n\nDonald Trump (27:00):\n\nThey’re sending prisoners, murderers, drug dealers, mental patients, and terrorists, the worst anywhere in the world. The only thing good about their criminals is they make our criminals like nice people. Because our criminals, I think, are much nicer than their criminals. But people think, “Oh, is there wonderful? The migrants are flowing in.” These migrants are coming from mental institutions, insane asylums. They’re terrorists. They’re coming from prisons and jails. There’s a little difference. They’re coming from prisons and jails by the millions.\n\n(27:35)\nAre we crazy to take this? This man, what he has done. I say it often. I say the rallies. This is a nice rally, by the way. This is a hell of a rally. I just heard that, 42,000. We expected maybe, because it’s freezing, right? It’s freezing. I’m freezing my ass off up here. At least they could have given me a little bit of a heater underneath this. They gave me nothing. See, they take advantage. My own people take advantage of me. They gave me nothing. But it’s one of those things, isn’t it? But we expected maybe 10,000 people. We have 42,000 people tonight, 42,000. As far as the eye can see. I wish the fake news media would turn those cameras. Look at all those cameras. Wow. Wow.\n\nAudience (28:41):\n\nBoo.\n\nDonald Trump (28:44):\n\nWow. Wow. That’s a lot. You know what? I wish they’d turned those cameras back, and all the way back as far as the eye can see, you have people. And I hate like hell to give them the prime spot, the media, because they don’t deserve. Look where that goes back to. That’s a lot of people. That’s a lot of people. But they never turned the cameras. You know what? Even our so-called friends, I won’t get into it, who’s our so-called friend. They never turned the cameras. And I always thought I’d say, “Please turn the camera, show the crowd.” You think that would be good for television purposes, positive. They’re showing these big crowds. They never want to show that we have these giant crowds, because they don’t like it. Because they don’t want us to win, because they’re basically progressive. They don’t use “liberal” anymore. They don’t like the term. They call it progressive. I think progressive is a beautiful word, but it doesn’t apply to them. It doesn’t. It’s too good a word. So we’ll call them liberal. But they’re liberal, and they don’t want to do it.\n\n(29:46)\nAnd you know what? When I first started this, I’d say, “Turn around and show the crowd. Show the crowd. Show the crowd.” And look at all these cameras. So we had all these cameras from day one. We never had an empty seat. Figuratively speaking, because we don’t have too many seats. We had people standing. But we never had an empty spot. We never had an empty seat. I’d say, “Show the people behind you. Show all the people.” They wouldn’t do it. And then a fight broke out in the darkest, deepest corner of the place, a fight. And those cameras turned around like a pretzel. They could do it. I thought they were just [inaudible 00:30:23] to steal. The cameras turned around like a pretzel to show the fight, because that’s a bad thing. [inaudible 00:30:31]\n\n(30:27)\n… she broke the record by 129 pounds. Are we crazy? How about the swimmer? She’s a world-class swimmer. And she was badly injured, as you know, badly, badly injured. She was a top swimmer. She grew up with the top swimmers all over California, all over the country. And she wanted to break that record. She was going to break it, too. She was close. She looked left just before the whistle went off. She looked left. And there was people she’s grown up with. For 15 years, she swam against them. She looked right. And there were people for 15 years, she swam against them. She knew every one of them. They were all good, but she was better. But then she looked to her very right, right here. And there was this giant human being, a man who about three weeks before was a man. But now he’s a woman. And she was seriously\n\nDonald Trump (32:00):\n\n… injured. You know why, right? Because he went by her so fast that the wind burn was just more than she could take. They immediately took her to the hospital. She suffered massive wind burn from the speed at which he went by her. She was trying to break the record by one-tenth of one second. He broke the record by 37 seconds. Are we crazy? Is he crazy? Really?\n\n(32:27)\nJust this week it was reported that an illegal alien… You just look at this, what’s happening, but it was reported that an illegal alien migrant from Afghanistan, who’s on the terror watch list, was released into the United States along with many other terrorists by crooked Joe Biden, despite being a member of a terrorist group, which is responsible for the slaughter of American troops in Afghanistan.\n\n(32:52)\nAll over the world they’re looking for him and he’s in our country now when we’re looking for him. Isn’t it wonderful? He should never have been here. I had a report that came out recently and it was on, I think it was on Deface the Nation. Ladies and gentlemen, it’s Donald Trump on Deface the Nation. But I think it was Deface the Nation or Meet the Fake Press and it showed charts and it actually had, I think it was 2019, that was one of my years, terrorist into our nation zero.\n\n(33:26)\nIt actually said zero. I don’t even believe that. I mean, I want to believe it, but that’s hard to believe, right? But it actually said zero, and then you go into 2021, 2022 and they had thousands of people pouring in, terrorists. But it actually said 2019 zero, zero. I don’t believe that. But I know it was very low because we really watched it closely. We watched it like nobody has ever watched it. I was very proud of that.\n\n(33:53)\nIt’s probably the only time they ever said anything that was actually better than the fact, right? Right here in Eastern Pennsylvania, you had an illegal alien criminal who murdered a woman in Chester County. Stabbing her 38 times in front of her seven-year-old daughter and her four-year-old son. A violent criminal. He was a violent, violent person. Then in September, that same illegal alien escaped from Chester County Prison and prowled through suburban communities. You all know about him. Hiding in backyards, breaking into homes until he was found with a stolen gun and he was ready to do massive damage all over your community.\n\n(34:29)\nJoe Biden’s border bloodbath. That’s what it is. It’s a bloodbath. A word that they misrepresented. His border bloodbath ends the day I take the oath of office. We will stop the plunder, the rape, the slaughter, the destruction of American suburbs and cities and towns. We will end deadly sanctuary cities. The Democrat mayors want to all end them, but they don’t want to really take on because they end up getting indicted. They go after these people, when they go against D.C. establishment, they end up getting indicted.\n\n(35:13)\nSo the Democrat mayors don’t like sanctuary cities, but they’re afraid to get indicted. I will shift massive portions of federal law enforcement to immigration enforcement. We will enforce our immigration laws stricter and stronger than anybody has ever done, including me, including me. We will impose a naval blockade on the cartels. When we stopped them on land, they’re very rich. They had ships. The most beautiful ships you’ve ever seen.\n\n(35:47)\nI mean, these guys are loaded. Nothing but cash and they were having boats and ships on the ocean, on the ocean, the Gulf come in through different ways. They’re very ingenious. The only thing they understand is strength. They understand strength and it’ll all stop. When I met with President Xi of China, I said, “Do you have a drug problem?” “No, no, no. We have no drug problem.” “Why is that?” “Quick trial?” I said, “Tell me about a quick trial?”\n\n(36:18)\nWhen they catch the seller of drugs, the purveyor of drugs, they immediately give them, the drug dealers, they immediately give them a trial. Takes one day. One day. At the end of that day, if they’re guilty, which they always are according to people that study this, I don’t think anybody has never been guilty, within one day that person is executed.\n\n(36:40)\nThey execute the drug dealers. They have zero drug problem, zero. They have zero drug problem in Singapore and other places. Instead, we set up blue-ribbon committees made of dilettantes from all over the country that know nothing about the evil genius of these drug lords that are taking us for a ride and the cartels that are making billions and billions of dollars because Joe Biden is a stupid person. We have a president who’s a stupid person. On day one we will begin the largest domestic deportation operation in the history of our country.\n\n(37:22)\nSo we’re pleased to be joined on this extremely beautiful, but little chilly, like about, but chilly. This is not bad. When I won the primary in Iowa, we won in a record. By the way, on the primaries, every single primary we won in the record numbers that have never been gotten before. From Iowa to New Hampshire, we won the caucuses, the Iowa caucuses, in double the margin that had ever been won before. We won New Hampshire, the largest number of votes ever gotten in the primary.\n\n(38:03)\nNow, think of this Republican or Democrat. Now you had Kennedy up there. It’s a little area for the Kennedys and others. We got more votes than anybody’s ever gotten in New Hampshire. We went to Nevada. We went all over. We went to South Carolina. We beat a certain governor there by so much. It’s so much. I’m the only one that can absolutely beat somebody by numbers that are unbelievable and they say… Set a record in doing it. It was a record. And then I have to hear, “He should have done better. Should have done better.”\n\n(38:37)\nIn Nevada we set the record. We set the record in every single state. Every single state. So I’m very honored by it and it’s really great. Really great. You know what bothers me though? This bothers me. I’m always watching Joe Biden and Donald Trump are the two candidates. They are both very unpopular people. I’m not unpopular. He is unpopular. He is unpopular. But I am not unpopular when 95% in the Republican Party and a lot of Democrats are going to vote for us because they don’t want to have open borders and drugs for everybody. Okay, they don’t want to have it. They don’t want to have a nation-\n\nAudience (39:18):\n\nWe love Trump. We love Trump. We love Trump. We love Trump.\n\nDonald Trump (39:19):\n\n… that’s not respected and wars to take place. Thank you.\n\nAudience (39:22):\n\nWe love Trump. We love Trump. We love Trump. We love Trump. We love Trump.\n\nDonald Trump (39:30):\n\nThank you.\n\nAudience (39:31):\n\nWe love Trump.\n\nDonald Trump (39:31):\n\nThank you.\n\nAudience (39:31):\n\nWe love Trump.\n\nDonald Trump (39:33):\n\nBut do you ever hear it? Joe Biden and Donald Trump are two very unpopular people. In all fairness to this guy, I mean, I don’t get it because he can’t speak, he can’t walk. He almost fell out of a helicopter the other day. I mean, there’s only four stairs. He held on for dear life. Oh, thank God. Those two fingers were just strong enough to hold him. But in all fairness to him, he beat all the competition. He beat it.\n\n(40:09)\nNow, they did things that aren’t… What they did to Kennedy was terrible. What they did, that’s what they do. They’re fascists. Okay? But what they did was terrible, but he did beat the competition. He did it I think probably unfairly just like they cheated on the last election, but they did beat the competition. But I’m really popular. I’m popular not necessarily, I think I have a nice personality. What do you think? I think so? I mean, it’s not terrible.\n\n(40:39)\nOur great first lady said, “I can’t imagine why they think you’re not a nice person.” She might be kidding when she says that. I don’t know. But I get these levels of I’m popular. Ronald Reagan was at 86%. Donald Trump is at 95%. That’s popular, right? So why do these thugs and these fake news people… There’s so many cameras back there. I can’t believe, that’s a lot of cameras. But you know what? Whenever I start talking about them, the cameras go off because I start talking about how bad they are. They’re less popular than Congress. Can you believe that?\n\n(41:21)\nAnd speaking of Congress, but we have great ones. We only deal with the great ones and we have great people here that love our country. They’re members of Congress. Dan Meuser, Dan, Lloyd Smucker, Lloyd, where is Lloyd? He’s around here someplace. Lloyd, where are you? Yes, hi, Lloyd. These are great people. Former congressman, he was a great congressman, Fred Keller. Where’s Fred? Hi, Fred. Are you cold in there? You don’t have a coat?\n\n(41:49)\nHe’s all man, that guy. I’d like to do that too, but I just refuse to freeze. I love these guys. Well, Mike Kelly, he used to come up with just an undershirt on, it would be like two degrees out, but he’s a very special guy. Mike Kelly, what a great guy. State Treasurer Stacy Garrity. Whoa, beautiful, beautiful person. She’s a beautiful person. State Senator Jarrett Coleman, Jarrett. Where’s Jarrett? Hi, Jarrett. Good job you’re doing.\n\n(42:20)\nState Representative Zach Mako and Milou Mackenzie. We have a special person with us tonight. RNC chairman just newly installed. He’s a tough cookie. He’s going to stop voter theft. He’s going to stop steal the vote. He’s going to Stop the Steal. We have lots of different… The bottom line is we don’t need any votes. We have all the votes. What we need is on election day, which unfortunately is now called election period because some of these things go 48 days. What the hell are they doing for 48 days? You know what they’re doing? They’re stealing the vote. But this guy was the head of the Republican Party in North Carolina and North Carolina was solid.\n\n(43:11)\nIt wasn’t like Pennsylvania. It wasn’t like other places that went, “Wah,” at the very end when all those votes came in late or early in the morning. Remember we won Pennsylvania. We were up by hundreds of thousands of votes and then all of a sudden, “Wah,” and we all know what happened. But it didn’t happen in North Carolina, and it’s not going to happen in Pennsylvania, and it’s not going to happen in Georgia this time.\n\n(43:39)\nIt’s not going to happen. RNC Chairman Michael Whatley, Michael. Great job, Michael. That was like, he had 600 lawyers working for him and there was nobody tougher on Stop the Steal. Thank you also to our super volunteers, Mike O’Hare, and Al Smith, Bob Smith, and Jessica Ware. They’ve been unbelievable. The job they’ve done from day one and they’ve been with me and they said, “We’ve never seen enthusiasm like this time.”\n\n(44:10)\nThe one said, Jessica said, “In 2016, it was good, really good. It was incredible. It was like a happening. 2020 was just as good and maybe even better, sir. This blows both of them away.” I think it’s true because you know what? You look at this crowd, you look at this crowd, which you can’t see the end of it, but you look at this crowd, and in all fairness, we’re six and a half months away from… That’s a long time.\n\n(44:37)\nMost of these candidates on the night before the election would have a crowd, that would be their largest crowd. They wouldn’t have anywhere near the people that we have right now. We’re six and a half months away. I wish we could move the election to Tuesday. Is there anything we can do? I want to move the election to Tuesday. In the U. K. they can pick their election. They say we’re going to have the election next week. I want to be able to do that. Would that be possible?\n\n(45:07)\nFrom the very first day that we take back the White House from crooked Joe Biden, I believe we’re going to have the four greatest years in the history of our country. In my first four years, I kept my promise to Pennsylvania and we ended the disaster known as NAFTA, the worst trade deal ever made, and replaced it with a brand new USMCA, that’s Mexico, Canada, the best trade deal they say ever made for our country.\n\n(45:37)\nFrankly, I know it’s good because Mexico and Canada want to redo it, they want to renew it, and they want it changed and crooked Joe Biden will probably do it. “How much? How much? Give me a couple of million bucks. I’ll get it done.” How much will it take to get crooked Joe? Don’t change the USMCA. They took advantage of us with NAFTA for years. Don’t change it. Don’t change it. They have to have it. But it’s always nice when you make a deal and they want to change it. I took on communist China like no administration in history bringing in hundreds of billions of dollars pouring into our treasury when no other president had gotten even 10 cents.\n\n(46:16)\nChina gave no other president 10 cents. I also gave $28 billion out of that money, I gave it to our farmers. I put powerful tariffs on foreign aluminum and foreign steel, which kept the steel industry in our country going and vibrant, but now Biden is changing that. We’re going to end up with no steel industry with this guy. Can you imagine? We’re in a war and we need steel to build our ships and build our tanks and we don’t have any.\n\n(46:45)\nYou’re in a war with China and we need… Because you see what’s going on today, we’re very close, we’re very close to a world war. We’re in a war with China and we need steel. So our guys, Joe Biden will call China. “Listen, any deal, can we make a deal? Can we have some steel? We have to build army tanks to protect us from you.” This is where we are. Our country is sick. Our country is sick.\n\n(47:13)\nWe’re like a house that’s burning down and it all happened over the last three years. We’ve got to turn it around. We love our country. We’ve got to turn it around. We’ve got to turn it around fast. Under Biden U.S. Steel is being… So think of this United States Steel Company, one of the great companies of the world 50 years ago, is being sold to Japan. Congratulations, Japan. U.S. Steel is being sold to Japan. My next term-\n\nAudience (47:40):\n\nBoo. Boo.\n\nDonald Trump (47:42):\n\nYou love that one, don’t you? Who would believe that U.S. Steel, I would not let that deal go through. In my next term, I will pass the Trump Reciprocal Trade Act. If China or any other country makes us pay a tariff or tax of 100% to 200%,\n\nDonald Trump (48:00):\n\nPercent. We will make them pay a reciprocal tariff of 100 or 200%.\n\n(48:09)\nAnd you know what that is, basically? You screw us and we screw you, and then everybody is even. And you know what happens? There’s no tax because everyone says, “Just forget it.”\n\n(48:20)\nWe will always protect Social Security and Medicare for our great seniors. Biden can’t do that. As President, I kept that promise and I will keep it once again. I didn’t touch your Social Security or your Medicare and there were plenty of Democrats that said, “Do it.” We’re not doing it.\n\n(48:38)\nWe have liquid gold under our feet, so much so that we don’t use. We don’t have to do things that people think. We have more liquid gold; oil, gas, a lot of things. Coal. Coal. You know, coal fires up the plants.\n\n(48:52)\nDo you know that China right now is building a massive coal plant, every single week? They’re opening up a coal plant, every single week, while we struggle with wind. Where’s the wind?\n\n(49:07)\nYou know the other problem? We can’t get the windmills. You know why? They’re made in China. China says, “Don’t worry about America. We’ll give them.” But wind doesn’t work anywhere. It’s too expensive. It doesn’t work. Kills all your birds. If you’d like to see a nice bird cemetery, walk under a windmill sometime. You’ll see more dead birds than anything.\n\n(49:25)\nIf you shoot an American eagle like a bald eagle, they put you in jail for five years. But the windmill, they kill them by the thousands. You know that, right, Mr. Congressman? They kill them by the thousands, so we’re very off as a country.\n\n(49:39)\nBefore I even arrive at the Oval Office, shortly after we win the presidency. It’s we. I will have the horrible war. That’s right. I will have the horrible war between Russia and Ukraine, totally settled. I will settle it and I’m the only one that can say this because these other people have no clue. I will prevent World War III.\n\n(50:07)\nAnd remember, World War III would be a war like no other because of nuclear weapons and many other types of weapons, that are at a level that nobody can even imagine. You don’t even want to talk about it.\n\n(50:20)\nWe’re going to rebuild our cities into beacons of hope, safety, and beauty, better than they have ever been before. We’re going to rebuild our cities and we’re going to work with Democrat mayors and Democrat governors, if we have to, but we’re going to rebuild our cities because our cities are going to hell.\n\n(50:35)\nWe will take over the horribly run Capitol of our nation, in Washington D.C., and clean it up, renovate it, and rebuild our Capitol city, so that it’s no longer a nightmare of murder and crime.\n\n(50:48)\nDo you see the crime that’s going on in Washington? Our beautiful Washington D.C.? People are being murdered all the time. They come from Pennsylvania and they want to go and see our Capitol and they get murdered. So much crime. So much horrible violent crime. But rather it will become the most beautiful Capitol anywhere in the world. We’re going to clean it up and we’re going to make it safe so our congressmen can walk into that wonderful place. That should be a wonderful place and right now it looks like hell. It’s filthy dirty with graffiti all over the place, garbage all over the streets, roads with potholes.\n\n(51:24)\nOn day one, I will sign a new executive order to cut federal funding for any school pushing critical race theory, transgender insanity, or other inappropriate racial, sexual or political content, onto the lives of our children.\n\n(51:42)\nI will not give one penny to any school that has a vaccine mandate or a mask mandate. And as I very embarrassingly said before, I will keep men out of women’s sports. Okay? And I will fully uphold our great Second Amendment, which is so important.\n\n(52:09)\nFor four years, despite tremendous efforts by the Democrats on the Second Amendment, we didn’t budge an inch. We didn’t budge an inch and I think you all know that. We will protect innocent life and we will restore free. We want to have paper ballots. We want to have proof of citizenship. We want now, because they have all these people coming in, we want proof of citizenship. It’s very important. But until then, Republicans must win. We want a landslide that is too big to rig. If you get the numbers too big to rig.\n\n(52:55)\nI love these people. Look, they’re huddled together. They’re huddled together. It’s freezing out here. They’re huddled together. I love it. It’s freezing. I hope they know each other. Do you know those people? They’re like, they’re so close. I’ve never… I hope you’re related. I don’t know if they are. I think that he’d never met her in his life and his wife is sitting right over here. This is not a good situation. This is politically unacceptable. Sir, I have to call you out. If you took the 10 worst presidents in the history of the United States and added them up, they would not have done near the destruction to our country as Joe Biden and the Biden administration have done. Worst president in history.\n\n(53:44)\nSo, if you want to save America, they get everyone, register them, register Republican, and vote. The Pennsylvania primary is Tuesday, April 23. Go out and vote. And sir, you know what? Somebody that you have to vote for. All our congressmen are in great shape. Right, Dan? I think you’re in great shape. All of them are in great shape, everybody they’ve all got.\n\n(54:11)\nBut I am officially giving my endorsement to David McCormick tonight. He’s a good man. He wants to run a good ship. He’s a smart guy. He was a very successful guy. He’s given up a lot to do this. And I’ll tell you what, he’s the nominee of the Republican Party. David McCormick. Go out and vote for him because Casey doesn’t do a damn thing. I tell you. He doesn’t do a thing. So go out and vote for him. Sign up. Volunteer for our campaign and let’s win big in November.\n\n(54:44)\nIn conclusion, and in conclusion, together we are taking on some of the most menacing forces and vicious opponents our people have ever seen. They are vicious and they are horrible. But no matter how hateful and corrupt the communists and criminals we’re fighting against may be, you must never forget this nation does not belong to them. This nation belongs to you. This is your home. This is your heritage. And our American liberty is your God-given right. Your God-given right.\n\n(55:21)\nFrom Harrisburg to Pittsburgh, from Easton to Bethlehem, and from Johnstown to Allentown, we stand on the shoulders of American legends, who poured out their blood, sweat and tears, for our rights and for our freedoms. And it’s been a very rough period of time. I’ll tell you what, for this country. It’s never had. I don’t think our country has ever been so low, but we’re going to change it. We’re going to get numbers like nobody’s ever seen. I think we’re going to swamp them. And this isn’t drain the swamp. This is we’re going to swamp them. We’re also going to drain the swamp. It’s a double swamp.\n\n(55:58)\nPennsylvania’s were our founding fathers, declared American independence. So much history. I mean, you have so much history here. Just think of it. It’s where the Army weathered its brutal winter. We’re sort of weathering it right now, but I don’t think… Theirs was much worse.\n\n(56:15)\nIt’s where the Army weathered its brutal winter at Valley Forge, where General George Washington led his men on a daring mission across the Delaware, and where our Union was saved by the immortal heroes at Gettysburg. Gettysburg. What an unbelievable battle that was, the Battle of Gettysburg. What an unbelievable, I mean, it was so much, and so interesting and so vicious and horrible, and so beautiful and so many different ways. It represented such a big portion of the success of this country; Gettysburg. Wow. I go to Gettysburg, Pennsylvania to look and to watch. And the statement of Robert E. Lee, who’s no longer in favor. Did you ever notice that? No longer in favor. “Never fight uphill, me boys, never fight uphill.” They were fighting uphill. He said, “Wow, that was a big mistake.” He lost his great general and they were fighting. “Never fight uphill, me boys.” But it was too late.\n\n(57:15)\nAnd this is the state where generations of tough, strong Pennsylvania miners, factory workers and steelworkers, forged the greatest nation in the history of the world. But now we are a nation in decline. We are a failing nation. We are a nation that has lost its confidence, willpower, and strength. We are a nation that has lost its way, but we are not going to allow this horror to continue. Three years ago, we were a great nation and we will soon be a great nation again.\n\n(57:49)\nAnd remember it was hardworking patriots like you, who built this country and it’s hardworking patriots like you, who are going to save our country. We will fight for America like no one has ever fought before. 2024 is our final battle. That is our final battle. We are either going to have a great nation again or we’re going to have a failed nation.\n\n(58:12)\nWith you at my side, we will demolish the deep state. We will expel the warmongers from our government. We will drive out the globalists. We will cast out the communists, for all they are tyrants, they are villains, and they hate our country. Like those patriots before us, we will not bend. We will not break. We will not yield. We will never give in. We will never give up, and we will never, ever, ever back down.\n\n(58:53)\nWith your support, we will go on to victory, the likes of which no one has ever seen, and we will evict crooked Joe Biden, the worst President in the history of our country, from the White House, on November 5th, 2024. And that date will go down as the most important day in American history. I believe that because we’re ready to be a failed nation. We’re a failed nation right now.\n\n(59:21)\nThe great silent majority is rising like never before and under our leadership, the forgotten man and woman, will be forgotten no longer. It wasn’t forgotten four years ago. I can tell you that. We are one movement, one people, one family, and one glorious nation under God, and together we will make America powerful again. We will make America wealthy again. We will make America strong again. We will make America proud again. We will make America safe again. And we will make America great again.\n\n(01:00:09)\nThank you very much, Pennsylvania. God bless you. God bless you all. Thank you.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald Trump (02:07):\n\nWell, thank you very much and you see the spirit from the hostages, and that’s what they are is hostages. They’ve been treated terribly and very unfairly and you know that and everybody knows that, and we’re going to be working on that sooner. The first day we get into office, we’re going to save out country and we’re going to work with the people to treat those unbelievable patriots, and they were unbelievable patriots and are. You see the spirit just cheering? They’re cheering while they’re doing that and they did that in prison and it’s a disgrace in my opinion.\n\n(02:43)\nSo I just want to thank you and I want to say a very special hello to Dayton because Dayton turned out to be a big victory for Trump and that was good for all of us. But I’m thrilled to be back with the proud, hardworking patriots of the great state of Ohio. I won this state and you won this state. But before going any further, I want to express our love for everyone touched by the terrible tornadoes that hit your state. They really hit it hard. Our hearts are with the families that lost a home or loved ones and it’s a very serious situation going on right now. So we are all praying for them and I know everybody here, this is a very big crowd, and I know everybody here feels the same way.\n\n(03:33)\nAs you know, this has been something very important to us. We see people in trouble. They’re really people in trouble. We’re going to help people in trouble. Right now our country’s in trouble and we’re going to help our country that’s in trouble and we’re going to make it great again and we’re going to do it very fast. So, as you know, this has been an incredible week for our campaign, unbelievable week. On Tuesday, we won Georgia, Hawaii, Mississippi, and Washington, and we won them in record numbers, by the way. I mean the numbers are crazy. What the hell is going on? Something’s going on here because nobody’s ever seen, they’ve never seen numbers like this. You know what it is? They see how bad these people are that are destroying our country. That’s what it is. And that’s, in my opinion, what it really is. And we clinched a thing called the Republican nomination for President of the United States. And to all Republicans, independents, and disillusioned Democrats, of which there are many, I invite you to join our movement to save our country and we’re going to save our country. This is the greatest movement in the history of our country and I was saying the other day that in 2016, one of the biggest issues was the border. And I sort of won on the border, I guess, maybe. And we fixed the border. We fixed it so good that I couldn’t even use it in 2020, even though we got millions and millions more votes in 2020, but we couldn’t even talk about it. I’d say, “I want to talk about the border. Tell them what a good job.” They said, “Sir, you fixed it. Nobody cares.” That border was a tiny fraction of what this border is. This is the worst border in the history of the world. There’s never been anything, millions and millions of people are pouring into our country, probably 15 or 16 million people. That’s almost larger than any state we have in the union.\n\n(05:43)\nAnd they’re coming in from places you don’t want to know about. So, we’re going to fix it again. But boy, what a mess. What these people have done to our country, it’s almost hard to believe frankly. The fastest way to reverse every single Biden disaster is to very simply just put me back in office. We’ll get it done quick. We’ll get it done very quickly. We want to have a rock-solid majority in the Senate. We want to take over the House. We have incredible people here with us today. Some great leaders and leaders that have been warriors for me, and that’s why we want to follow up our historic victory this week. That was a great victory, the biggest and the fastest ever. It’s never been won that quick. We moved very quickly. We got very tough in the end, didn’t we? We had no choice. We wanted to get a little tough to get it over with and we got it over with.\n\n(06:38)\nBut it’s the fastest ever. And that means we have the longest wait ever. Seven months is a long time, a little more than seven months. It’s like an eternity when you have people that are incompetent running your country into the ground. But if we could, we’re going to take that victory and we’re going to add to it with Bernie Marino, who’s a fantastic guy. Bernie is a fantastic guy. He’s getting some very tough Democrat fake treatment right now, and we’re not going to stand for it because I know this man. We all know this man. He’s a hero. He’s a winner. And we are not going to let these people. These people are sick between Russia, Russia, Russia for two years and Ukraine, Ukraine, Ukraine, 51 intelligence agents. I want one after another, one would stop and then they’d lie again. And all the way to where we are right now where we’re leading Biden by numbers that nobody’s ever seen before and we have to keep it going.\n\n(07:42)\nSo Bernie Marina, we want to… Where is Bernie? Is he around? There he is, Bernie, and a great family and Max. We love Max. Max was with me for four years, a great congressman and Bernie, I heard you’re doing really well. I heard you had a great poll today. You got to win, Bernie. Don’t leave me alone. Don’t leave me alone, Bernie. But Ohio needs to defeat your horrendous radical-left Democrat, Senator Sherrod Brown, who pretends he’s my best friend. He pretends he’s my best friend until he gets in, and then he goes radical-left all the time. If you listen to his commercials, he sounds like he’s running with Trump. He’s not. He’s not.\n\n(08:24)\n“Now I agree with the President on borders. I like the president on the economy and on… I like him. I think he’s great.” He’s not with me. And the day he gets out, he votes with Biden all the time. And if you vote with Biden, this country is finished. I’ll tell you right now. And we have to elect Bernie to get in there and to seal our border. Stop inflation, crush the Deep State. We started that when we got rid of Comey. Drill, baby, drill and prevent World War III.\n\n(08:58)\nAnd remember this, remember this, Joe Biden is a great threat to our democracy. He’s a tremendous threat to our democracy. His incompetence is the number one reason. Also, he uses the Justice Department, the FBI to go after his political opponent. Happens to be me. How are we doing? And he’s driven my numbers through the roof. Do it one or two more times. How about a couple more indictments, Joe, you dumb son of a… You dumb son of a… Somebody said, “They’re indicting this guy into the office of president,” but they’ve never done that in this country before. That’s never happened. But we are going to discuss that. The nice thing we have, it’s a beautiful day, a little windy out here I must be honest with you, but that’s okay. It’s good when you don’t have to use a teleprompter because I can’t read a word on. They’re moving around. I don’t know what the hell I’m doing up here, Bernie, these suckers are moving. My guys did a great job in planting them solidly. Thank goodness we can do a non-teleprompter speech. It’s actually much better. But these teleprompters, they’re moving around. I’m trying to go… I’m trying to… No, we don’t need them. Isn’t it nice to have a president who doesn’t need a teleprompter? Isn’t that nice? These suckers are moving around. Great job, fellas. I appreciate it.\n\n(10:34)\nFor your vote, we’re going to take back the Senate, we’re going to win Ohio in November. We’re going to win by a lot. We’re up like 16 or 18 points. I saw one, we’re up 20 points in Ohio and we’re going to look at crooked Joe Biden and we’re going to say, “Joe, you’re fired. Get out of here. You’ve done a terrible job. You’ve done a terrible job. You’ve been a terrible president.” He’s a terrible president. He’s the worst president we’ve ever had. There’s never been a president so bad as this guy. There’s never been anything like it. He’s incompetent. He’s crooked. He doesn’t know what the hell he is doing. Can’t walk off a stage. Can’t put two sentences together. He’s a disaster for our country. I say it. I say it a lot. I used to say five worst presidents, right? Now I say, if you took, and I say it and I think I can go up further, what do you think? Another three or four add, another three, four, or five.\n\n(11:31)\nIf you took the 10 worst presidents in the history of our country, put them together, they will not have done the damage to our country as this incompetent, crooked guy has done to our country. And that’s what he is. And you know, to be honest, I treated him with more respect than I do now. I don’t treat him with respect because he did this weaponization thing with the DOJ and the FBI. They raided my house and once he did that, I said, “Well, I guess that game is over.” Nobody thought it was possible. In fact, even the lunatics over at CNN and MSDNC, they would say, “Well no, these aren’t crimes. These aren’t crimes.” You fight an election and they end up indicting you because you fought a crooked election.\n\n(12:18)\nThink of it. You fight a crooked election and they indict you. They don’t indict the guys that made the election crooked. They go, “The people that want to have honest elections get themselves in trouble,” because these people are sick in Washington. And we are going to change it around fast. I’ll tell you right now.\n\n(12:39)\nBut among my very first actions upon taking office will be to stop the invasion of our country and send Joe Biden’s illegal aliens back home. These are the roughest people you’ve ever seen. Now we have a new form of crime. I call it Biden migrant crime, but it’s too long. So let’s just call it migrant crime. We have a new category. You have vicious crimes, you have violent crimes, you have all these, now we have migrant crimes and they’re rough. They’re rough and it’s going to double up. And you see what’s happening. Throughout the world right now, I don’t know if you know this, crime is way, way down. You know why? Because they sent us their criminals. That’s why. It’s true. It’s true. They sent, do you know Venezuela is down 66% because they sent us their gang members and their gangsters. They sent us their drug dealers and their murderers. They’re all coming into our country and Venezuela now, their crime is down 66%. And all over the world, crime is down because they’ve sent them to the United States of America because we have a stupid president that allows this to happen. Stupid. Thank goodness we have JD here. That’s all I can tell you. Boy. Hi, JD. We have Jim Jordan, we have the heavyweights, we have Jim. We have the whole group. Wow, that’s exciting. Now, Jim Jordan doesn’t mind the fact that they’ve sent us all their murders. He’s very liberal. You know that. He thinks it’s, what? No. You know what? I’m looking at JD. I’m looking at these guys. They’re like seething as I talk, seething. They’re so angry. Think of it, all over the world, they’re smart people. I know many of the leaders. I got to know them very well. They’re smart. They’re tough. They’re streetwise. We have a man that can’t talk. He can’t even talk. He doesn’t know where the hell he is. He can’t find his way off a stage like this. Well, this one’s tougher because we only have four stairs and a long ramp. So this one I can understand, but he can’t find his way off a stage. Can’t do anything. And he’s in charge of dealing with Putin and Xi and Kim Jong-un of North Korea.\n\n(15:11)\nThe whole thing is crazy. It’s crazy. But when these guys, who are incredible, when these guys hear the stories about crime, to me that’s one of the worst of all. And this is all over the world. They’re sending from all over the world, not just South America, Latin America. They’re sending them from Asia. They’re sending them from Africa. The Congo, last night, 22 people arrived from the Congo. Now, the Congo is a very nice place I would imagine, but they arrived from the Congo and they came from prison. Where are you from in the Congo? What’s your address? Prison. Now these are rough people. They’re coming from Africa, they’re coming from Asia, they’re coming from the Middle East, they’re coming from Yemen. All over the place from Yemen. I thought we were bombing Yemen. Here we go with a bombing again. You could solve that whole problem with a phone call if they respected you, but they have no respect for this guy. They have no respect for him whatsoever.\n\n(16:12)\nViktor Orban, the Prime Minister of Hungary, very tough man, probably the toughest guy there is frankly, toughest in Europe. A lot of people don’t like him because he’s tough. He says, “I don’t want to have criminals in my country if that’s okay with you.” They asked him, “What’s going on with the world? What’s happening?” This is three weeks ago. They interviewed him. “What do we do? The world is blowing up Israel, Ukraine, the whole place is blowing up. What do you do?” He says, “You get back President Trump. When President Trump was president, we had none of this. Ukraine wouldn’t have been attacked. They wouldn’t be fighting with Russia. Russia wouldn’t have attacked them.” For a lot of reasons, number one, I said don’t do it. And number two, the oil prices were too low for them to do it. They couldn’t have afforded it.\n\n(17:01)\nOctober 7th, Israel would’ve never been attacked. Iran was broke. I say it respectfully. Iran was broke. They had no money because they weren’t allowed to sell oil. I told China, “If you buy one barrel of oil from Iran, we’re not going to do business with you. We’re going to put tariffs all over the place. We’re going to raise your tariffs to 100%.” I’d already raised them to 50%. We took in hundreds of billions of dollars from China. No other president took in 10 cents from China, not 10 cents. We took in hundreds of billions of dollars from China and others. And others.\n\n(17:44)\nUnbelievable when I see it going. But I got to know all these people. They’re very smart, very streetwise. And I would do the same thing if I had prisons that were teeming with MS-13 and all sorts of people that they’ve got to take care of for the next 50 years, right? Young people, they’re in jail for years, if you call them people, I don’t know if you call them people. In some cases they’re not people in my opinion, but I’m not allowed to say that because the radical left says that’s a terrible thing to say. They say you have to vote against him because did you hear what he said about humanity? I’ve seen the humanity and these humanity, these are bad. These are animals and we have to stop it. We can’t have another Laken. We have so many people. We have so many people being hurt so badly and being killed. They’re sending their prisoners to see us. And they’re bringing them right to the border and they’re dropping them off and we’re allowing them to come in.\n\n(18:41)\nAnd these are tougher than anybody we’ve got in the country. These are hardened criminals and we’ve got hundreds of thousands of them and we’re not going to take it. We’re just not going to take it. They are destroying our country. I’m telling you, he’s the worst president we’ve ever had and the most incompetent president we’ve ever had. And he’s also the most crooked president we have ever had. Now, other than that, I think he’s doing an excellent job. Do we agree? Other than that, quite good, right, JD? Those few things. He’s incompetent. He’s crooked. He’s the dumbest guy. How the hell did this happen? What a fake election that was.\n\n(19:23)\nHe ran from the basement. We got more votes than any sitting president in history but we lost. I was told if we got 63 million votes, we couldn’t lose, by Fabrizio, great pollster, John McLaughlin, great pollster. “Sir, if you get 63 million, you cannot…” We got 75. We got much more than that. We got… They report almost 75 million. They report, not 63, 75. We lost by a whisker, just a whisker, with their mail-in-ballot hoaxes. You better go quickly to paper ballots, voter ID, and one-day voting, or you’re not going to have anything. One week ago I met with a family of 22-year-old nursing student, incredible person, Laken Riley, who was brutally murdered in Georgia last month while out on a morning run. She was so badly beaten up, unrecognizable, can you believe it? Laken’s killer was set loose into the United States through Joe Biden’s program of releasing military-aged males into our communities after they’ve illegally crossed our southern border.\n\n(20:36)\nAnd that’s what happened, that this animal came in. Laken Riley would be alive today if Biden had not unleashed his savage attack on America, and that’s what he’s done. But instead of apologizing to Laken’s family, Joe Biden apologized to the killer for calling him illegal. “I shouldn’t have done that. Oh, I’m so sorry. I shouldn’t have called him illegal. Oh, I’m so sorry. I’d like to apologize,” to the killer. He’s more concerned with the killer. He couldn’t even pronounce her name right. He’s more concerned with the killer than he is with Laken. And that’s the problem. They’re more concerned with criminals than they are with the people of our country, that built our country, and that are keeping our country afloat because that’s all with the policies they have, all you can do is keep it afloat and you’ll be lucky if you do that.\n\n(21:28)\nAnd let me tell you, seven months is not a long time in one way. In another time, it’s eternity because these guys can do damage like nobody’s ever… I don’t know. They either hate our country or they’re grossly incompetent. And anybody that can cheat on elections the way they do is not incompetent. Okay? I think they hate our country. So now they have a new term for people like this. They call them neighbors. Neighbors. They want to call them neighbors so that people coming into our country illegally, “Hi, neighbor. How you doing, neighbor? How’s everything?” Then they punch you in the face and whack you. What a group of idiots we have. This country has never seen anything like what’s happening to it now. And it’s true. We have never seen what’s happening to our country right now. They’re destroying our country. They’re ruining our country.\n\n(22:20)\nIn the Republican party, we believe that Laken’s killer is an illegal alien criminal. He is an illegal monster. He should never have been in our country and he would’ve never been in our country, never ever would he have been in our country if the election weren’t rigged because we didn’t allow people like that into our country. We didn’t welcome them and they knew it. Does anybody like the snake? Do you you know the snake? I don’t know. I can’t even hold this. I can’t even hold this sucker in this wind, but we’ll give it a shot. Do you mind? Let’s do it. Because you know what? As\n\nDonald Trump (23:00):\n\nAs I’m discussing this and on the understanding that we have no teleprompters, at least let me read one little thing here. But this is a metaphor, most of you have heard it. People love it. It’s a very accurate metaphor and it’s about our border. It’s about the people we have coming in. And don’t be surprised when bad things happen because bad things will happen and we’re going to get them out fast. We’re going to have the largest deportation effort in history. But with all of that, we’ve got ourselves a problem. When you have 15 million people, many of them, many of these people are people that should not be allowed into our country.\n\n(23:41)\nOn her way to work one morning down the path along the lake, a tender-hearted woman saw a poor half frozen snake. His pretty colored skin had been all frosted with the dew. “Poor thing,” she cried, “I’ll take you in and I’ll take care of you.” Very innocent, very innocent. “Take me in oh tender woman. Take me in for heaven’s sake. Take me in oh tender woman,” cried the snake. She wrapped him up all cozy in a comforter of silk and laid him by her fireside with some honey and some milk. She hurried home from work that night, and as soon as she arrived, she found the pretty snake she’d taken in had been revived. ” Take me in oh tender woman. Take me in for heaven’s sake. Take me in oh tender woman,” cried the vicious snake.\n\n(24:43)\nOh, Front Row Joe got it. Look, I can’t believe it. You’re unbelievable. They’ve come to 127 rallies. I don’t know what the hell they do, but they must have a lot of money because there’s a… Stand up Front Road Joes. I can’t believe it. And that play, it fell right at… Look at them, fold up. That’s incredible. There’s nobody more deserving of it than you guys, because you guys are amazing. Thank you very much. This is number 127 for them. And I don’t like to say it in front of them, but we have people that have actually come to more. Our wonderful women from North Carolina, right? Trying to figure out about their husbands, how they can handle it, but they seem to be handling it.\n\n(25:32)\nShe clutched him to her bosom. “You’re so beautiful,” she cried. “But if I hadn’t brought you in by now, you truly would’ve died.” She stroked his pretty skin again and kissed and held him tight. But instead of saying, “Thank you, ma’am,” the snake gave her a vicious bite. “Take me in oh tender woman. Take me in for heaven’s sake. Take me in oh tender woman,” sighed the vicious snake. “I saved you,” cried the woman. “I saved you, I saved you and you’ve bitten me, but why? You know your bite is poisonous. Your bite is poisonous and now I’m going to die.” “Shut up, silly woman,” said the reptile with a grin. “You knew damn well I was a snake before you took me in.”\n\n(26:29)\nNow that’s what we’re going through right now. We’re taking in snakes, we’re taking in snacks. Yeah, maybe this one gets to you too. We’re taking in… We’ll get it to you. We got to smile about this. Look, if you don’t have a little bit… It’s just so crazy. There’s not much to smile about, but we have to keep our chin up because what’s happening to our country has never happened before. Nothing like this has ever happened before. There’s a gentleman named Sean Hannity. He goes on every night. He’s a good man. He says, “A hundred percent certain that you’re going to have massive attacks and big problems.” And I have to agree with him. I’ve been right about everything they say. Trump’s been right about everything. I have to agree that it’s going to be. We have to work very quickly, but unfortunately for seven months and now really for two months after that, you’re not going to be working. You’re going to be in the world of politics. And they’ll be saying, what a wonderful thing it is that they’re destroying our country.\n\n(27:34)\nHow anybody can say what they say, is unbelievable. Not one more American life should be lost to migrant crime. When I’m President of the United States, we will demand justice for Laken. On day one my administration will terminate every open border policy of the Biden administration. We’ll begin the largest domestic deportation operation in American history, larger than that by far of Dwight Eisenhower. Eisenhower had a similar problem, but peanuts by comparison. It’s like the border, I did a great job in the border. The border was terrible, but it was peanuts by comparison to what it is now. It was a small percentage. Now, I mean, nobody’s ever had to go through this, nobody ever. No one has been hurt by Joe Biden’s migrant invasion more than our great African American and Hispanic American communities. You know that, right? Because they’re taking your jobs and they’re creating lots of problems.\n\n(28:37)\nAnd you know who else it hurt? People on social security, because your social security will be destroyed by the people coming in. There’s too many of them, it’s not sustainable. Joe Biden is costing you Medicare and he’s costing you your social security as sure as you are sitting or standing. Look at the group of people. This was supposed to be a little thing for Bernie. Bernie, if these people all vote, which they will, you’re going to win, man.\n\nCrowd (29:20):\n\nBernie, Bernie, Bernie, Bernie.\n\nDonald Trump (29:20):\n\nWow, That’s a lot of people back there. Wow, that’s very impressive. They said, “This is just a little rally for Bernie.” That’s not a little rally. I can’t even see the end of the crowd. Well, get out and vote. Good man. Get out and vote. With his open border policy Joe Biden has repeatedly stabbed African American voters in the back, including by granting millions and millions of work permits, taking their jobs. The African American community, the Hispanic community, are going to be the ones that suffer the most. And you know who else? Unions. Because unions are getting good, solid high pay. And guess what’s going to happen? Those unions are going to go out of business because people are owning trucking companies and carpenters and people that employ electricians. And a lot of trades, they’re not going to be able to do this. They’re not going to be able to do it. The unions are going to go out.\n\n(30:17)\nThe Teamsters are in trouble. I’m dealing with the Teamsters. They should endorse me. I don’t know if they will or not. I know the Teamsters are going to vote for me. The teamsters that do the work, the head Teamsters, Sean and everybody. They’re good men, they’re good people, and I hope they’re going to endorse Trump. I think it would be nice. It’s been many decades before that’s happened. But if you look at the United Auto Workers, what they’ve done to their people is horrible. They want to do this all electric nonsense where the cars don’t go far, they cost too much and they’re all made in China. And the head of the United Auto Workers has never probably shook hands with a Republican before. They’re destroying… Mexico has taken over a period of 30 years 34% of the automobile manufacturing business in our country. Think of it, it went to Mexico. China now is building a couple of massive plants where they’re going to build the cars in Mexico and think, they think that they’re going to sell those cars into the United States with no tax at the border. Let me tell you something to China, if you’re listening, President Xi, and you and I are friends, but he understands the way I deal, those big monster car manufacturing plants that you’re building in Mexico right now, and you think you’re going to get that, you’re going to not hire Americans and you’re going to sell the cars to us. Now, we’re going to put a 100% tariff on every single car that comes across the line, and you’re not going to be able to sell those cars, if I get elected. Now, if I don’t get elected, it’s going to be a bloodbath for the whole… That’s going to be the least of it. It’s going to be a bloodbath for the country. That’ll be the least of it. But they’re not going to sell those cars. They’re building massive factories. A friend of mine, all he does is build car manufacturing plants. He’s the biggest in the world. I mean, honestly, I joke about it. He can’t walk across the street, in that way he’s like Biden. But for building a plant, he can do the greatest plants in the world, right? That’s all he cares about. I said, “I’d like to see one of your plants.” Recently, I said, “I’d like to see. Where can we go?” “Well, we have to travel to Mexico.” I said, “Why Mexico?” He said, “Because that’s where the big plants are building. China’s building really big plants in Mexico and Mexico’s building…” “What about here?” “Well, we’re building much smaller plants here.” Can you believe it? Can you believe it?\n\n(32:41)\nSo what they’re saying, Jim Jordan, is that we’re going to make cars in Mexico and they’re going to do it… You’re not going to stand for that, Bernie. JD, I have a feeling JD is not big into that policy. 100% tariff, they won’t sell any cars over here. And I’ll tell them if they want to build a plant in Michigan, in Ohio, in South Carolina, they can, using American workers, they can. They can’t send Chinese workers over here, which they sometimes do. But if they want to do that, we’re welcome, right? But they’re not going to build them in Mexico and they’re not going to do that. We’re going to tariff them at 100% just like I’ve done… I saved the steel industry. The people that like me, the most of the steel companies, but now I’ve been out for a little while. And guess what? United States Steel, 50 years, 60 years ago, maybe the greatest company in the world was just sold to Japan. How do you like that?\n\n(33:41)\nUS Steel owned and controlled by Japan. I wouldn’t have allowed it to happen. Hopefully they won’t allow it to happen. When I’m president, we will end this Biden betrayal of the African American community. We will stop the theft of American jobs and protesting and all of the things. We have to protest, we have no… Today, people that protest get arrested in this country. We never had that before. They can rip down Portland, they can rip down Minneapolis, and they can do whatever the hell they want, nothing happens. If a Republican or a Christian, frankly… And what’s happening with the Catholics? The Catholics are under siege. Any Catholic that votes for this numb skull is crazy because you are being persecuted.\n\n(34:33)\nNow, I’m being persecuted, I think more than anybody, but who the hell knows? All my life you’ve heard of Andrew Jackson, he was actually a great general and a very good president. They say that he was persecuted as president more than anybody else, second was Abraham Lincoln. This is just what they said. This is in the history books. They were brutal, Andrew Jackson’s wife actually died over it. They say died of a broken heart, but she died over it. He was never quite the same. But they say Andrew Jackson, they say Abraham Lincoln was second, but he had in all fairness, he did have a civil war. So you would think that would cause a problem, right? So you could understand it. But nobody comes close to Trump. And now even the wonderful historians, the fake historians they have in CNN, you ever see these guys? Biden makes a State of the Union speech, one of the worst speeches’ anybody here has ever heard.\n\n(35:27)\nAnd at CNN, they said, “That was one of the greatest speeches I’ve ever heard. That was one of the great…” MSDNC, MSNBC, a bunch of fakes. They go, “That was one of the greatest speeches I’ve ever heard.” You know that CNN turned off. Here we are, we campaigned for a year, and I obliterate my competition. And they said, “Sir, please don’t talk about these people that way. They’re Republicans.” I said, “I don’t give a shit. They’re terrible.” I said, “I don’t care.” And my highly paid advisor, “Sir, you shouldn’t talk to them about that.” One of the people said, they said, “Are you going to run against the president?” He said, “I have no comment.”\n\n(36:15)\nTo me that meant he’s running. So I hit him hard, I hit him low, I hit him just like we did to Isis, we hit him hard. We hit him low, we hit him high, we hit him in the middle. We hit him from on top, and we even came under the ground. We hit this guy so hard, by the time he announced, nobody knew what the hell happened. They said, “What happened to him? He’s a shell of the man.” But we had other people too we have to hit hard. And the reason we have to hit hard is we have to win. We have to hit our enemies hard. We have to hit them and treat them with respect. But if they don’t treat us with respect, we have to do things because our country’s in trouble. We don’t have the same country that we had three years ago.\n\n(36:54)\nWe were energy independent three years ago. Today we’re begging Venezuela for oil, think of it. We’re begging Venezuela for oil, and we’re not going to stand for it. We’re going to turn this around and we’re going to turn it around fast. Somebody said, “We really like this person or that person because they can serve for eight years. They should serve…” I said, “If it takes you more than a year to fix the problem, you have the wrong people.” That was actually something, that was a political attack line, JD. They said, “He could be here for eight years.” I said, “If it takes you more than a year, you got the wrong guy.” I said, “If it takes you eight years to set this thing up, you don’t want to vote for him.” So that’s the story.\n\n(37:35)\nIt’s my first term, and we built the greatest economy. Think of it, in my first term we built the greatest economy in the history of the world. We had the highest tax cut ever. Ronald Reagan didn’t do anything even by comparison. We had the biggest regulation cuts and rising wages for citizens of every race, religion, color, and creed. And we had a thing called no inflation. How do you like the idea of no inflation? Under Biden, the cost of rent is up 30%, groceries are up 30%. Everything is up, chicken’s up, bread is up. And I can’t read this teleprompter. This sucker is moving around. It’s like reading a moving flag in a 35 mile an hour wind.\n\n(38:48)\nAnd then they say, “Trump’s a bad guy because I’ll say this, don’t pay the teleprompter company. Don’t pay, don’t pay.” And then he’ll say, “Trump didn’t pay me.” And they’ll say, “Oh, Trump’s a horrible human being. He’s terrible.” They gave me a pile of crap, this is the craziest thing. And look at all the television I have up there. I got all the television. And they won’t say that. They’ll say, “Trump made a speech, it wasn’t so good. It wasn’t so good.” It’s funny, I was asking Jim Jordan about it because he was commenting that we have the largest crowds in the history of politics, nobody comes close. If Ronald Reagan came to a place called Dayton, Ohio, have you heard of it? If he came to Dayton, Ohio, honestly, JD, if he had three or 400 people in a ballroom, that would be great. We get 25, 30,000 people, a small rally is 20,000 people. We had 88,000 people show up in South Carolina. There was no venue, so we used the whole town. You read it, we used the whole town. The whole town was flooded, and it was unbelievable.\n\n(39:57)\nAnd I said, “But nobody’s ever had…” We had one in Alabama. I call it the Mo Brooks speech because Mo Brooks got up. He asked me for an endorsement. He was an election denier, which is the right thing because the election was crooked. And Mo Brooks got up and he hired, I believe it was either Mitt Romney or John McCain’s management team. But before that, he asked me for an endorsement, I gave it to him. He took a 54 point lead. Then he called me and said, “I’d like to do a rally.” Mo Brooks, a friend of Jim, right? Mo Brooks, legendary. Where’s Mo? What happened to Mo? So he gets up and I said, “You don’t need a rally. You got a 54… Let me do rallies for people that need it.” “Sir, I’d like to have a rally. You have a 54 point lead. It’s Alabama where I won it by 45 points, okay?” I love Alabama, but they understand we don’t have to be there. We have to be in places that are a little closer than that.\n\n(40:57)\nAlthough I happen to think we won most of the country if you want to know the truth. If the voting were real, I actually think we won most of the country. I actually think we got a lot of Ohios all over the place that you won’t really recognize. But Mo Brooks got up, he said, “Sir, I’d really appreciate it.” And we went to the state fair, 68,000 people showed up at the state fair. And an old guy came out. He looked like he was about 103. He said, “You know, did something I never thought would happen in Alabama.” He said, “This was the state fair.” And I guess he owns it. He said, “I’ve been at this place for 60 years, 70 years, a long time, and you just broke the attendance record of a man named Elvis Presley.” Can you believe it? And he said, “You just broke it, man.” He said, “I never thought that would be possible.” We had 68,000 people.\n\n(41:50)\nSo Brooks gets up and he says, “Let’s forget about the election. The election was fine. Let’s just forget… We have to get onto the future.” He got booed. I was downstairs being interviewed by ABC fake news. And what happened is I said… You couldn’t hear anything. The place exploded with boo, boo, boo. He took a 54 point lead into that rally and he reduced it to, he was losing by 20 by the end of the night. He dropped 74 points. And we have a very wonderful senator. I endorsed her the following morning, Katie Britt. She was doing a good job. Who liked the job she did the other night? I thought she did a very nice job. Liberals didn’t like it very much, I guess, but I thought she did a very nice job.\n\n(42:42)\nBut we have another senator now, because people don’t want to hear bullshit, they don’t want to hear it. They want a country that’s run correctly, that’s run properly, and they want fair elections and they want borders. They have to have borders. If they don’t have borders, you don’t have a country. But if you don’t have fair elections, you don’t. And you know what I add to it more and more? The fake news, they should be the police of our country. Because if they were legit… The biggest problem I have with them is the things they don’t report. They barely, until recently, they would not talk about the borders. They wouldn’t talk about the fact that our country’s being destroyed at the borders. It’s what they don’t say that’s a problem, and they don’t say a lot. And what they do say is fake news. So other than that, I think they’re fantastic.\n\n(43:39)\nI’ll move this over here. Great job fellas. Don’t pay these suckers, please. Don’t pay. Whoever the hell did that, the son of a gun. These people. I think Joe Biden put them in. With your vote we will throw out the Bidenomics and we will reinstate a thing called MAGAnomics, MAGAnomics. Crooked Joe Biden and his socialist thugs are looting trillions and trillions of dollars from the American people and giving it to radical left lunatics and friends. But Biden’s reign of plunder and terrorists stops the day I take the oath of office. The hardworking American taxpayer will once again have a friend and a fighter and a champion in the White House.\n\n(44:33)\nBiden’s socialist spending, his socialist spending, is really what’s happening, your social security is going to be gone. They don’t say it, they never say it. You will not be able to have social security with this guy in office, because he’s destroying the economics of our country. And that includes Medicare, by the way. And American seniors are going to be in big trouble. I made a promise that I will always keep Social Security, Medicare, we always will keep it. We won’t be cutting it. We have liquid gold under the ground. We’ll be drilling like a son of a gun. But we’re leaving your social security around. They won’t. And they can’t make that pledge because their economic theory is no good. Because they’re taking in millions and millions of people in this country and they’re spending.\n\n(45:24)\nI look at New York, and New York is very low on money for years. And New York State, very, very low. And a lot of people want to leave because of the lawfare that’s going. A lot of companies are leaving because they don’t want to get caught up into the crap that I got caught up into, where they go after you for no reason whatsoever, no victim, no this, no that. They let violent criminals roam the streets, roam in the subways, but they go after Trump all the time. And people get tired of it, companies don’t want to be subject to that. But if you take a look at all of the things that are happening, the money, the billions and billions of dollars,\n\nDonald Trump (46:00):\n\n… and I say, where did they get this money? California the same thing. Gavin Newsom. S-C-U-M is his last… No. Gavin Newsom. He this guy he’s always talking about. Oh, California, it’s great. They’re losing a fortune. People are moving out. I have property there. I love California. One of the most beautiful places. They’re destroying it. They’re destroying California. This guy is a horrible, horrible governor. In a certain way, I’d like him to run, to be honest. I just think it would be… He’s just a bullshit artist. It’s crazy. He’s done such a bad job, but you look at what Democrats have done. Look at Illinois. I don’t know how it continues. You have this guy Pritzker. I don’t know, he’s too busy eating. He wants to eat all the time. Would you like a hamburger? How many do you want? Five. I’ll have five burgers, please. You go to his office. Would you like a hamburger? Yeah. Okay, I’ll have five burgers please. Who the hell orders five burgers?\n\n(47:11)\nBut look, our can’t go through it and we’re not going to go through it much longer. We play the song, you know that, Hold On I’m Coming. Do we like it? Okay, we had the Rolling Stones song, which we liked. That was for first. You know that song, right? You Can’t Always Get What You Want, which made no sense, but it was a good song. It made no sense. They asked me, I say no, they’re talking about the Democrats. I said, the Democrats can’t always get what they want, so that way I at least saved it, but it was a good song. Or the Sam & Dave. Who likes the second better, Hold On I’m Coming? Yes. Do you like it better? Yeah, both good.\n\n(48:02)\nThe other does bring back some good memories in all fairness. It’s really no wonder that Joe Biden and his thugs are so desperate to stop us, they only know and you remember this. We’re the only ones, and they know this, that can stop them. We’re the only ones. There’s nobody else around. If this election isn’t won, I’m not sure that you’ll ever have another election in this country. Does that make sense? I don’t think you’re going to have another election in this country if we don’t win this election. I don’t think you’re going to have another election or certainly not an election that’s meaningful and we better get out or we better… I actually say that the date, remember, this November 5th, I believe it’s going to be the most important date in the history of our country. I believe that.\n\n(48:53)\nThis country is weaponizing law enforcement for high level election interference against Biden’s top political opponent. Never happened. We’re not going to let it happen. We’re not going to let it happen. I’ll tell you what, my numbers are much higher than they would’ve been had these idiots, like deranged Jack Smith… Somebody said, “Why do you call him deranged?” I said, “Because I like telling the truth.” He’s a deranged individual. They said, “But why don’t you be nice to him?” Because if you were nice to him, he’d be much worse. He’s a bad guy. They’re all bad people. They want to destroy our country and we’re not going to let them destroy our country. We’re not going to let it happen. All of the persecution is only happening because I’m running for president and leading in the pulse. If I weren’t running, I wouldn’t have any indictments.\n\n(49:43)\nI got indicted more than Al Capone. Does anybody know who Al Capone is? Alphonse Capone. He would even take a guy like JD and slap him around. He’d take JD, who the hell are you Senator? I’d slap you around. No. He used to kill people. If he didn’t like their company at dinner, he’d kill them. He got indicted less than I did. My father’s looking down and my mother, was such a beautiful woman, and she’s looking down with my father and she’s saying, “How the hell did our boy get four indictments?” Not only that, all these local cases like Fani, Fani. It spelled Fani. It spelled Fani like your ass, right? Fani. But when she became DA, she decided to add a little French, a little fancy, Fani and Mr. And Mrs. Wade, which his wife did not appreciate, his wife didn’t appreciate.\n\n(50:50)\nCan you imagine these two people trying to take down a very popular, I’m a very popular president. Again, I got more votes than any sitting president in history. We have these two low lives trying to take down a President of the United States. But equally badly, they went after 26 people. They wanted to make it 48 people. They had some senators that these guys know very well who were indicted, who were ready to be indicted, and somebody stopped it and they wanted to find out what the hell is going on in Georgia? What’s going on with the elections? It’s so crazy, and they almost got indicted for that. Think of it, United States senators that were doing their job. These people are low lives and they were sent here by the Department of Justice. This isn’t a local Georgia thing. They would go in to Washington DC and have meetings that lasted for eight hours on numerous occasions with the Justice Department and the White House. So it’s all politics. It’s all coming in from Biden. The same thing with Letitia James from New York. This is another real low life. She campaigned on, I will get Trump, I will get him. I will get him. Then she goes to court. Oh no, I’m not political. I’m not political at all. Then you have Bragg, the DA. So in the DA’s office, they didn’t trust Bragg, so they took their top person from the DOJ. His name is Colangelo. They took him and they put him in the DA of Manhattan’s office to get Trump. Think of it. Other than that, I’m having a lot of fun. I’m having a lot of fun. It’s an unbelievable situation.\n\n(52:44)\nBut I think with time it’s become so discredited, don’t you think, Jim? Actually Jim Jordan had hearings on Bragg and how did they turn out? What a mess. What a disgraceful… We can’t let this happen to our country. In the latest Emerson Poll, general election, I’m up nine points here in Ohio, and another poll I’m up 14 points, and in another one we’re up 17 points. I only read polls when they’re good by the way. Nationwide, we’re leading in every single swing state against Biden in the largest margins ever.\n\n(53:25)\nYou know what was interesting? Joe Biden won against Barack Hussein Obama. Has anyone ever heard of him? Barack Hussein Obama, or as Rush Limbaugh would say, Barack Hussein Obama. He used to scream out the name Hussein. Just think of this. Every swing state, Biden beat Obama, but every other state he got killed. You think that’s an honest election? I could give you 100 different things. We better straighten out our elections. We better get smart because the people of the country are not going to take it. We’re not going to take it. We’re not going to take it any longer.\n\n(54:06)\nThe radical left Democrats rigged the presidential election in 2020, and we’re not going to allow them to rig the presidential election in 2024. Not going to allow it to happen. Every time the radical left Democrats, Marxists, communists and fascists indict me, I consider it a great badge of honor. Great badge of honor because I’m being indicted for you, and never forget our enemies want to take away my freedom because I will never let them take away your freedom. That’s what this is all about. They want to silence me because I will never let them silence you. In the end, they’re not after me, they’re after you. I just happen to be standing in the way. Okay?\n\nCrowd (54:56):\n\nUSA, USA, USA, USA, USA, USA, USA, USA, USA.\n\nDonald Trump (54:56):\n\nBut if you wanted to defeat the radical left Democrats, you first have to get out. You have to vote and vote for Bernie Moreno. He is a great guy. They’re doing a number. I didn’t think I’d say this because they’re doing a number on him just like they’ve done on everybody else. That’s all they do. Disinformation and misinformation, they’re masters at it. They lie, they cheat. These people, they lie, they cheat. They make up fake stories like Russia, Russia, Russia. They made up the Russia, Russia, Russia story. Then I won that. No collusion after 18 angry Democrats that there was no… They didn’t have anything. They went through millions of phone calls, not one call to Russia. It was a fake deal made up by crooked Hillary for losing, although I don’t call her crooked anymore. I’ve reversed it, right? It was made up by Hillary Clinton. And how about this guy, he may end up being a United States Senator, right? Shifty Adam Schiff. Think of it. Can you believe it? He may end up being a senator.\n\n(56:25)\nThis is one of the most dishonest human beings. He made up my conversation that I had with the president of Ukraine. He made up the conversation. He said, there were seven times quid pro quo. Remember that? Quid pro quo seven times. Now, think of it. That means you’ve threatened somebody seven times. I want money, I want this. Then you say it again, I want money. I never spoke to the guy. He would think I’m a total lunatic. But he said seven times he asked. He made the speech in Congress. I said, good, I’ll sue this guy that I learned you can’t sue any congressman because they have total immunity. They can say whatever they want in Congress. But here’s what they didn’t know, the phone call, because it was a White House call and for some reason it happened to be on tape. So I let them go more and more. The stories got wilder and wilder.\n\n(57:20)\nThen we released the tape. Nancy Pelosi, who’s a major sleaze by the way, a major sleaze, Nancy Pelosi, she said to her people, what the hell did you get me into? You hear this call? He didn’t do any of this stuff. You know what they said? Let’s just pretend he did and keep going forward. That’s how that whole thing came. So she knew it was false because she heard it. But I will tell you this, after they made up the story and then after that they heard the tape, they died. They didn’t know that phone call was taped. That was one good case of a phone call being taped. They were taped and they got caught. You know what they do? They took two weeks off and then they said, Ukraine, Ukraine. They went into a new scandal.\n\n(58:07)\nThese are bad people. These are sick people. And they’re doing it here too. They’re doing it to a very good man and we can’t let it happen. I said on the plane, I’m not going to talk about it. I won’t talk about it. But I didn’t know I wouldn’t have teleprompters. I have nothing else to talk about to be honest. I have nothing else to talk about. But you just have to remember, these are disinformation and misinformation. Slightly different. I won’t go into the difference, but there is a slight difference. They’re masters at lying essentially, and they make up stories about people. They made up many about me and I fought them off.\n\n(58:43)\nI want to tell you, if anybody else were nominee, they would’ve done the same thing to them and they wouldn’t have been able to take it. I think Front Row Joes would agree. If those people that were running against me in the Republican primary, had they succeeded, and you have to say they didn’t even come close. Not even a little close. But you know why? Because you love the job I did for four years. For four years. You want to get back to the best economy that we’ve ever had. But had they succeeded, they would’ve come in with the same kind of stuff and they would’ve been hitting them and they wouldn’t have been able to handle it. I can promise you. Bernie is a political outsider who spent his entire life building up Ohio communities. He’s highly respected all over the country, and he’s going to be a warrior in Washington. Bernie’s strong on borders. He’ll fight to crush the cartels that are flooding our towns and cities with Fentanyl and deadly drugs. Now we’re going to stop that. We’re going to get it stopped and we’re going to get it stopped fast.\n\n(59:41)\nWe’re essentially at war. I believe we lose 350,000, not a 100,000. They keep saying a 100,000, 90,000, 100,000. I believe you’re losing 350,000 people a year. You wouldn’t lose that many of you were fighting a war. Fighting a war would be a lot easier than fighting this, and we’re going to get it stopped. I almost had it stopped and then we had the bad election. I went to President Xi. I said, “We’re not going to do any business if you keep sending Fentanyl,” because it comes from China and it comes through Mexico. Sort of simple, but they’re smart and they’re not exactly… Look, they’re the enemy when you think of it. They’re the enemy. But it comes through Mexico, but it’s made in China. I said to President Xi, “If you keep doing this, we’re going to stop doing business with China. You’re not going to make your $500 billion a year.” We had it down, way down.\n\n(01:00:36)\nNobody has ever talked to China the way I did. No president, we never took in 10 cents. I took in $440 billion from China. They were not exactly unhappy with that election. But I said to President Xi, who I actually had a great relationship with other than he likes China and I love the United States, and I said, “You can’t do this. You can’t do this with what you’re doing, sending Fentanyl, and if you’re going to continue to do it, we’re not going to trade with you and we’re going to charge you the highest tariffs of any country anywhere in the world and it’s going to be effective immediately.” He says, “No, you don’t have to do that. We will put maximum penalty on the people that are making the Fentanyl.”\n\n(01:01:22)\nI said, “I know what your maximum penalty is, and you do too. Does that mean the death penalty?” “Yes, we will give them the death penalty if they send Fentanyl into the United States.” That was all done and it was all set to go into effect. Then we had a thing called the rigged election, and it never got done because when Biden came in, he can’t talk that way to China because they’ve given him a lot of money. They give him a lot of money. Do you ever notice how timid he is with China? The reason he’s timid is because they know much about him that you’ll never know. He’s a Manchurian candidate. He’s a pure Manchurian candidate. They know things about him that you’ll never know unless they want to reveal it. So, all of a sudden we have a very weak president on China, but I expose China and I’m very proud to have done it.\n\n(01:02:13)\nBernie will vote to save the American auto industry along with me. We’re working hard and JD and everybody else that’s working on it because our auto industry is going to be dead very quickly because of the head of the United Auto Workers, the deal he made is so crazy. It’s so bad. Short term, two years, but you’re not going to have any cars being made here anymore. For him to allow an all electric mandate on cars that just don’t go far. If I want to drive to Washington, DC from Dayton, I have to stop four times. If you want to drive on a tank of gasoline, you can drive there. It’s not going to be acceptable. People aren’t going to have it. You can’t build that number of chargers. You know the charging booths. If you were going to build the charging booths that are necessary, our country would be immediately bankrupt because it would cost trillions and trillions and trillions of dollars.\n\n(01:03:16)\nBy the way, I’m a big fan. You can have electric cars if you want them, but you also have to have other forms of movement. You have to have other forms. You have to be able to have and use gasoline. Here we are, we have more oil and gas than any country in the world. We have more than Russia, we have more than Saudi Arabia, and we’re not allowed to use it. You know that this guy is now getting his oil from Venezuela. Venezuela was the enemy. This guy running Venezuela, call him a dictator. Call him what you want, he’s going to be the richest guy in the world. He’s got all of his criminals leaving and a lot of people are leaving. He’s going to end up with Venezuela and about 50 friends and the United States under a very stupid president buying their oil.\n\n(01:04:10)\nWe’re buying oil from Venezuela. You know where they purify the oil? Place called Houston, Texas. Houston, Texas. That’s where they refine it. So they take out the oil and Venezuela, they have tar. They have tar, which is a very low level, and you have to heat it and heat it. If you’re a big environmentalist, we do it in Houston, Texas. So we take it out there. Think of it, if you believe in this, like a lot of people do, and I’m okay with it, those fumes are leaving the United States because the only refinery that could do that oil, the tar, it’s not even oil. The only refinery that could do it happens to be in Houston and it’s not a pretty site. I’ll tell you what. That’s where we are now.\n\n(01:04:56)\nBernie will be tough in China, ferocious on crime. He’ll be great on election integrity. He wants to get wokeness out of our military. Don’t worry too much about… I watched our military knock out ISIS. I did it in four weeks. I knocked out ISIS in four weeks, they said it was going to take four to five years. We have great generals, we have great military. They’re going to be okay. But on top is woke. How about the changing of the names of, we won Fort Bragg as an example. The people in the area are going crazy. They changed the name of Fort Bragg. They changed the name of Fort Robert E. Lee. They changed the name of the different forts.\n\n(01:05:41)\nWe won World War I, we won World War II. We won everything we fought with really, essentially, from those forts, if we wanted to win. A lot of wars, we fight not to win. We fight just to fight because we have stupid people on top. We don’t fight wars to win. But we won World War I, World War II out of these forts, and now they changed the name in disgrace. It’s a very terrible thing.\n\n(01:06:05)\nBut Bernie will not let the radical left Democrats raise your taxes. They want to raise your taxes to a level that you’ve never seen before. The tax cuts that I got you, the biggest tax cuts in history, they expire soon. The Democrats don’t want to renew them. That will go down as the biggest tax increase in the history of our country. It’s going to be very bad. But JD and Bernie and all of us, we have a lot of good people in the Senate, we have great people in the house, and we’re not going to let it happen, Jim. Is that right? We’re not going to let it happen.\n\n(01:06:44)\nSo Bernie’s running against a weak rhino named Matt Dolan. Now, here’s what I know about Matt. I don’t know much about him. He’s trying to become the next Mitt Romney. I think Mitt Romney is his hero. Matt Dolan once ran for office as a Democrat, and he’s easily pushed around by the woke left lunatics who renamed his family’s baseball team. Now, think of this. I happen to like baseball, I like sports, and I like tradition. So you have a team called the Cleveland Indians. Indians. They’re Indians. They took the name Cleveland Indians and made it the Cleveland Guardians. It almost like they’re in charge of a trust fund. They’re in charge of a trust fund, the Cleveland Guardians.\n\n(01:07:37)\nMy attitude is anybody that changes the name of the Cleveland Indians to the Cleveland Guardians should not be a senator, should not be a governor. I don’t know Matt Dolan, but I just know that he’s the guy that I guess owns the team in some form and he was in charge of changing the name. Okay, we’ll have a poll. Who wants to keep the Cleveland Indians storied? Wait. So much for that poll. Okay, ready? Who wants to see the name change to, the way they did it, the Guardians? Who wants the Guardians? Okay, nice and loud. Now, who wants to keep it the Cleveland Indians? That wasn’t too tough, right?\n\n(01:08:32)\nSo this guy, Matt Dolan, who’s weak on borders, weak on crime, he wants to vote a mass amnesty bill for illegal aliens. He cares more about spending your money too and sending it to Ukraine. You know what? We will do things with Ukraine. We should loan them the money, not send them the money. We should loan them the money so that if they do make it, if they make it, they’re against tremendous odds. But if they make it, they pay us back. Loan\n\nDonald Trump (01:09:00):\n\nLoan them the money. Give it to them as a loan. Let them be a little bit like they have to be a little nice. Loan them the money. Don’t just hand them a check for $60 billion. I’ll tell you Zelenskyy is one of the greatest salesmen in history. Every time he comes to the country, he walks away with $50 billion or $60 billion. I’ve never been able to do that. He’s a better salesman. He’s a much better salesman than I am. But think about it, Dolan wants to have left-wing gun control. He voted against a law to let Ohio citizens defend themselves from dangerous criminals. You’re not allowed to have your gun, but the criminals are allowed because they’re not going to follow the law. So they can walk into your place and you’ll say, “Please, please don’t do it.” It’s crazy. It’s crazy. There’s nobody better to the Second Amendment than me. I’m the strongest and the best ever. They never touched it and it was not easy.\n\n(01:09:55)\nMatt Dolan also strongly supported Joe Biden’s, $1.2 trillion- dollar Green New Scam, it’s called the Green New Scam, which helped cause rampant inflation. It’s not the biggest. The reason for inflation was what they did with energy and oil When they closed up the oil. Now he’s drilling like crazy. He went back to my policy. You know why? Because it was up to $6, $7, $8 a gallon. So now he said, “Just go back. Just go back. After the election we’ll kill these people.” And that’s what’s going to happen. They went back to my drilling policies. They allowed them to continue drilling, but the day after the election, it’s over. They are sick. That’s why this Tuesday you need to elect America’s first champion Bernie Moreno to the US Senate. And Bernie, if I could, I’d like to have you come up and say a few words, please. Thank you.\n\nBernie Moreno (01:11:05):\n\nLadies and gentlemen, the Republican nominee for 2024 and the future 47th President of the United States of America. I want to clear something up. I want to clear something up for everybody here. I am so sick and tired of Republicans that will say, “I support President Trump’s policies, but I don’t like the man.” This is a good man. This is a great American. This man wakes up every day fighting for us, fighting for this country. He loves this country like no other leader of this nation has ever loved this country, and we have Republicans that say that because they’ll bend their knee to the media and they want to be their best friends, and so they’ll disparage this man. How does Ohio feel about President Donald J. Trump?\n\nDonald Trump (01:12:20):\n\nThank you, Bernie. Thank you. Thank you very much. Thank you. I have to say, so we did all of us. It’s we. It’s not me, it’s all of us. We did great in 2016. We did great in 2020. There was tremendous spirit. There’s never been spirit like we have now. There’s never been. 2016, and we did much better in 2020. You see it. You know it. And we had unbelievable rallies. Unbelievable. There’s never been spirit like we have right now, and that’s because you got a glimpse of what these people are doing to our country, which you didn’t have before. So it’s been really pretty amazing, I will tell you that.\n\n(01:13:08)\nWe’re also pleased to be joined by a friend of mine and somebody that has really turned out to be great. When you endorse somebody you don’t know, you think they’re going to be good and they turn on you and I’ll give you plenty of examples, but perhaps not now. But this guy turned out to be an absolute star. He is a young star and he’s a great senator and a real fighter. J.D. Vance. J. D., Great job. Great job. You want say something, J.D., we have to say it. Come on up. Come on. He should say. I think we should. Hey, it’s a nice Saturday. What the hell? We have nothing else to do.\n\nJ.D. Vance (01:13:46):\n\nIt’s good to see you, man. Thank you. Thank you. Well, first of all, I got to say the teleprompter really does look like hell here. The president’s telling the truth here. But look, let me say something. It’s a real statistic, sir, I looked this up. Do you know that all of the net job growth under Biden’s presidency has gone to the foreign-born and Donald Trump’s presidency, the job growth went to American citizens? Let’s rebuild prosperity for America’s citizens and reelect Donald J. Trump.\n\n(01:14:26)\nI know he loves this country. I know he loves the state of Ohio, and I know he loves Bernie Moreno. Let’s help Donald Trump out elect Bernie Moreno and elect Donald Trump in 2024. God bless you, sir.\n\nDonald Trump (01:14:40):\n\nThank you. Thank you.\n\n(01:14:54)\nThank you very much, [inaudible 01:14:56]. Now I’m telling you there’s never been spirit like this party has, and I hate when I listen to these people. They say, “While Biden and Trump are extremely unpopular…” I’m not unpopular. I got 92% approval rating with the Republican. But they like to say, “Biden and Trump,” Don’t put me with him, “these guys are unpopular.” He can’t talk. We have a very special woman who’s hot as a politician. She’s doing an incredible job in South Dakota. She’s the governor. Kristi Noem. Thank you, Kristi. Thank you. Great job. Come on up. Thank you,\n\nKristi Noem (01:15:43):\n\nThank you. Thank you, Mr. President. Mr. President, when you were in the White House and I was governor of South Dakota, every single day I got to get up and be on offense. I could call this man in the White House and I would tell him what problem I had with the federal government or a foreign country or a trade agreement or helping a business be successful and he would say, “Kristi, let’s do it.” We will fix it. As soon as Joe Biden got in the White House, I went on defense. All I do now is fight to protect the freedom of my people. That is the difference that leadership has. That’s the difference that this man has. Let’s put him back in the White House so we can be on offense, we can make America great again and we can do it with US senators like Bernie Moreno, thank you so much for being here for Bernie. We’re going to win. We’re going to win big.\n\nDonald Trump (01:16:37):\n\nThank you very much. And you’re not allowed to say it, so I will not. You’re not allowed to say she’s beautiful, so I’m not going to say that. I will not say it because that’s the end of your political career. If you make that statement, that’s the end of your political… So I will not say that. We also have one of my favorite people in Washington, one of my favorite people anywhere frankly. He’s a fighter. He is a warrior like you’ve never seen. People don’t know about Jim Jordan that he was a great wrestler. And in high school, and this is something it’s almost hard to understand because you know as a freshman, and if you’re wrestling seniors, a freshman can’t beat a senior. He went undefeated in all of high school. He never was defeated. So he was wrestling as a freshman against seniors, and someday he’s going to explain to me how he did that because that’s pretty good.\n\n(01:17:27)\nHe then went on to be one of the greatest wrestlers in the history of the NCAA, I think. He also became an All-American and his sons are All-American wrestlers, and they’re just a fantastic family. The family is so incredible and he’s somebody, he just gets it done. He’s a warrior. Jim Jordan. Jim? I got to get him. Come up here. Come up here, Jim. We got to get him up. Please explain how a freshman defeats a senior.\n\nJim Jordan (01:17:58):\n\nWell, I would just say this. The left controls just about everything. The left controls big media. The left controls big tech. The left controls big corporations. The left controls big sports. Watch the NBA. The left controls Hollywood. The left controls higher education. The left controls the White House, the left, maybe most importantly controls the federal bureaucracy, but the left doesn’t control we, the people. And we, the people, we, the great people of this great country, are getting set in November to put the best guy we’ve ever had in the White House, back in the White House. And starting Tuesday, we’re getting ready to put Bernie Moreno in the United States Senate. God bless you all. Thank you very much.\n\nDonald Trump (01:18:50):\n\nThank you, Jim. Great guy. We also have Ohio Attorney General Dave Yost. Dave, thank you very much. Thank you. Thank you, Dave. Great job you’re doing. Great job. Indiana Attorney General, Todd Rokita. Todd, thank you. Thank you. Nice seeing you, Todd. Great job you’re doing. Ohio GOP Chair, where are you? Where are you? What a job. Where are you? Come up. Just come up, wave to everybody very quickly because you have done an incredible job and thank you very much. I appreciate it. Thank you. Former state GOP Chair, Jane Timkin, a friend of mine and a wonderful woman. Hello, Jane. There you are. I’m looking for Jane. I called her before, “How’s things going?” She said, “Things are going good.” Kareem Lanier and J.R. Majewski. Now, J.R., they hit J.R. very hard, I have to tell you. These are friends of mine. J.R. Was a hero and is a hero, and they hit him very hard with false stuff that he wasn’t a hero and after the election, they found out he was, and on behalf of our country, I’d like to apologize to J.R. Majewski because you were treated very unfairly. Okay? You were treated very unfairly. The guy was a hero, and they came out with a narrative that he wasn’t a hero. And I think it’s a disgrace, a disgrace. I got to know him because he was carving the name Trump into farmland as I was flying over your state.\n\n(01:20:27)\nAnd I’d say, “Boy, that’s the biggest Trump I’ve ever seen. Those are the biggest letters.” And I said, “Who did that?” And his name is J.R. Majewski. And I just thought it was great. And I introduced him. And then he went into a primary with six very talented, good people, and he was not even thought about. And he ended up winning that primary because of one rally where I introduced him. But he is a hero and everybody now knows it. Thank you J.R., very much. Appreciate it.\n\n(01:20:56)\nFrom the very first day that we take back the White House from crooked Joe Biden, I believe we are going to have the four greatest years in the history of our country. In my first four years, I kept my promise to the workers of Ohio, to the workers of our country. We ended the disaster known as NAFTA, the worst trade deal ever made and replaced it with a brand new USMCA, Mexico, Canada. That’s the best trade deal they say ever made. Actually, the best trade deal I made was the deal with China, but I don’t even talk about it. They have to buy $50 billion worth of our products. But after we all had to suffer through that horrible China virus or COVID, I don’t talk about it, but this was a great win for Ohio farmers and for Ohio manufacturers. I took on communist China, like no administration in history, bringing in hundreds of millions. Think of this, we started with hundreds of millions of dollars the first couple of months, and I said, “This is pretty good.” We ended up taking in hundreds of billions of dollars from China. Not one president ever took in 10 cents. They never asked them for anything. And we were rocking and rolling, and we were doing great. We had the greatest economy ever.\n\n(01:22:11)\nAnd for our great veterans, we passed VA Accountability and VA Choice. We did something that nobody… Because of guys like Jim Jordan we had to get it passed through Congress, and we got it passed through Congress, and that was a big deal. We fully rebuilt the US military and we created Space Force. And I was the first president in decades who started no new wars except I brought our troops back home. We had no new wars, but we defeated ISIS. Everybody said it couldn’t be done. We did it very quickly. And we have a great military, I’ll tell you. I saw that with ISIS. Once I let them go, I said, “Go ahead, fellas. Do what you have to do. General Raisin Caine. “What’s your name?” “General Raisin, Sir.” “What’s your last name?” “Caine.” I said, “Your name’s Raisin Caine. I love you. This is what I’ve been looking for. I’ve been looking for a guy named Raisin Caine,” and he knocked him out.\n\n(01:23:06)\nBefore I even arrive at the Oval Office, shortly after we win the presidency, I will have the horrible war between Russia and Ukraine settled and we will restore peace through strength. That’s what we need. Peace through strength. And I will pass the Trump Reciprocal Trade Act. If China or any other country makes us pay 100% or 200% tariff, which they do, we will make them pay a reciprocal tariff of 100% or 200%. In other words, you screw us and we’ll screw you. It’s very simple, very fair. We don’t do that. And as tariffs on foreign countries go up, taxes on American workers and families will go very substantially down and will bring businesses back to our country because want to avoid paying the tariffs. It’s very simple. It’s what other countries do to us. And I had it going. And then we had the gift from China, the COVID come in. We did a phenomenal job in that. Never got the credit, always got the credit for the military, always got the credit for ISIS, and so many things. Always got the credit for the economy and for no inflation.\n\n(01:24:19)\nWe did a great job with some unknown disease at the time. Nobody knew what the hell it was. And what we did was a miracle and we led the world. And when I left office, our stock market was higher than it was just prior to COVID coming in, which is a tremendous achievement. We would’ve gone down the tubes. That would’ve been a 1929. And speaking of 1929, there are some brilliant Wall Street analysts like Scott and some others, but very brilliant Wall Street analysts that say, “The only thing good right now about our economy is the stock market. And the only reason that that’s good is because people think that Trump is going to be elected president. And if they ever thought that he wasn’t, you would end up with a crash, the likes of which we haven’t seen since 1929.” So they can take that the way they want. But I happen to agree that there’s a lot of hope that we get back in. We had a great stock market.\n\n(01:25:17)\nWe had the most successful economy in the history of our country by far. We had really the most successful economy probably in the history of the world and people weren’t taking advantage of us and China was paying up. Nobody could get away with what they were getting away with. I made new trade deals with Japan, with South Korea, with Vietnam. We made so many new trade deals. The deals were so bad. I used to sit back and look at these deals. I said, “Who could have negotiated these deals?” They were so one-sided. We changed them all. On day one, I will terminate crooked Joe Biden’s insane electric vehicle mandate. We will restore law and order to our country, and I’m going to indemnify all police officers and law enforcement officials throughout the United States to protect them from being destroyed by the radical left for taking strong action on crime.\n\n(01:26:14)\nWe’re going to rebuild our cities into beacons of hope, safety and beauty, better than they ever have been before. And we’re going to be working with Democrat mayors and Democrat governors if we have to. Our dying cities, they’re all run by Democrats. We’re going to work with them, and we’re going to restore our cities. We will take over our horribly run, horrible, horrible, horrible, the capital of the United States of America, Washington D.C. We will clean it up, renovate it, and rebuild our capital cities so that it will be an absolute beacon of beauty and peace and prosperity, and no longer be the crime capital, virtually, of the world. People are being killed there. Every single week people are being killed. I lost a young man who was fantastic in the administration. Two weeks ago, he was going to pick up his wife and he was waiting for her. And a thug came along and said, “I want your car.” And he shot him and killed him as the wife is coming out to be picked up by her husband who she loved. And he died almost immediately.\n\n(01:27:26)\nWe can’t let this happen to our country. We can’t let this happen. On day one, I will sign a new executive order to cut federal funding for any school pushing critical race theory, transgender insanity, and other inappropriate racial, sexual or political content onto our children. And I will not give one penny to any school that has a vaccine mandate or a mask mandate. And something I can’t believe I have to say, but I have to say it because the Democrats are pushing it. I will keep men out of women’s sports. I will fully uphold the Second Amendment. We will protect innocent life. We don’t have free speech anymore. Today you speak and they want to put you in jail. Today you speak and they want to put you in jail, even if you’re telling the truth. They want to put you in jail. We will restore free speech to our nation, and I will secure our elections. We will have fair and honest elections again.\n\n(01:28:37)\nBut until then, you have to go and you have to vote. You have to vote like you’ve never voted before. And I said it before and I’ll say it again. This is all about November 5th, the most important day, I believe. I really believe this. I used to say in 2016, “This is going to be the most important vote.” I didn’t say that in 2020 because we had the country going really well. In fact, we had a statement, “Keep America great.” It was going to replace MAGA. In a certain way I’m glad it didn’t because MAGA is MAGA. It’s always going to be MAGA as opposed to KAG. But it was Keep America Great and America was great. We made it great. And then we had a bad election. A horrible, horrible thing happened, because…"
    }
]